GopalSaraf/Practicals/PSDL/include/proc/pic18f66k40.inc
// Register: IPR4
#define IPR4 IPR4
IPR4                                     equ 0E23h
// bitfield definitions
IPR4_TX3IP_POSN                          equ 0000h
IPR4_TX3IP_POSITION                      equ 0000h
IPR4_TX3IP_SIZE                          equ 0001h
IPR4_TX3IP_LENGTH                        equ 0001h
IPR4_TX3IP_MASK                          equ 0001h
IPR4_RC3IP_POSN                          equ 0001h
IPR4_RC3IP_POSITION                      equ 0001h
IPR4_RC3IP_SIZE                          equ 0001h
IPR4_RC3IP_LENGTH                        equ 0001h
IPR4_RC3IP_MASK                          equ 0002h
IPR4_TX4IP_POSN                          equ 0002h
IPR4_TX4IP_POSITION                      equ 0002h
IPR4_TX4IP_SIZE                          equ 0001h
IPR4_TX4IP_LENGTH                        equ 0001h
IPR4_TX4IP_MASK                          equ 0004h
IPR4_RC4IP_POSN                          equ 0003h
IPR4_RC4IP_POSITION                      equ 0003h
IPR4_RC4IP_SIZE                          equ 0001h
IPR4_RC4IP_LENGTH                        equ 0001h
IPR4_RC4IP_MASK                          equ 0008h
IPR4_TX5IP_POSN                          equ 0004h
IPR4_TX5IP_POSITION                      equ 0004h
IPR4_TX5IP_SIZE                          equ 0001h
IPR4_TX5IP_LENGTH                        equ 0001h
IPR4_TX5IP_MASK                          equ 0010h
IPR4_RC5IP_POSN                          equ 0005h
IPR4_RC5IP_POSITION                      equ 0005h
IPR4_RC5IP_SIZE                          equ 0001h
IPR4_RC5IP_LENGTH                        equ 0001h
IPR4_RC5IP_MASK                          equ 0020h
IPR4_CCIP3IP_POSN                        equ 0000h
IPR4_CCIP3IP_POSITION                    equ 0000h
IPR4_CCIP3IP_SIZE                        equ 0001h
IPR4_CCIP3IP_LENGTH                      equ 0001h
IPR4_CCIP3IP_MASK                        equ 0001h

// Register: IPR5
#define IPR5 IPR5
IPR5                                     equ 0E24h
// bitfield definitions
IPR5_TMR1IP_POSN                         equ 0000h
IPR5_TMR1IP_POSITION                     equ 0000h
IPR5_TMR1IP_SIZE                         equ 0001h
IPR5_TMR1IP_LENGTH                       equ 0001h
IPR5_TMR1IP_MASK                         equ 0001h
IPR5_TMR2IP_POSN                         equ 0001h
IPR5_TMR2IP_POSITION                     equ 0001h
IPR5_TMR2IP_SIZE                         equ 0001h
IPR5_TMR2IP_LENGTH                       equ 0001h
IPR5_TMR2IP_MASK                         equ 0002h
IPR5_TMR3IP_POSN                         equ 0002h
IPR5_TMR3IP_POSITION                     equ 0002h
IPR5_TMR3IP_SIZE                         equ 0001h
IPR5_TMR3IP_LENGTH                       equ 0001h
IPR5_TMR3IP_MASK                         equ 0004h
IPR5_TMR4IP_POSN                         equ 0003h
IPR5_TMR4IP_POSITION                     equ 0003h
IPR5_TMR4IP_SIZE                         equ 0001h
IPR5_TMR4IP_LENGTH                       equ 0001h
IPR5_TMR4IP_MASK                         equ 0008h
IPR5_TMR5IP_POSN                         equ 0004h
IPR5_TMR5IP_POSITION                     equ 0004h
IPR5_TMR5IP_SIZE                         equ 0001h
IPR5_TMR5IP_LENGTH                       equ 0001h
IPR5_TMR5IP_MASK                         equ 0010h
IPR5_TMR6IP_POSN                         equ 0005h
IPR5_TMR6IP_POSITION                     equ 0005h
IPR5_TMR6IP_SIZE                         equ 0001h
IPR5_TMR6IP_LENGTH                       equ 0001h
IPR5_TMR6IP_MASK                         equ 0020h
IPR5_TMR7IP_POSN                         equ 0006h
IPR5_TMR7IP_POSITION                     equ 0006h
IPR5_TMR7IP_SIZE                         equ 0001h
IPR5_TMR7IP_LENGTH                       equ 0001h
IPR5_TMR7IP_MASK                         equ 0040h
IPR5_TMR8IP_POSN                         equ 0007h
IPR5_TMR8IP_POSITION                     equ 0007h
IPR5_TMR8IP_SIZE                         equ 0001h
IPR5_TMR8IP_LENGTH                       equ 0001h
IPR5_TMR8IP_MASK                         equ 0080h
IPR5_CCH05_POSN                          equ 0000h
IPR5_CCH05_POSITION                      equ 0000h
IPR5_CCH05_SIZE                          equ 0001h
IPR5_CCH05_LENGTH                        equ 0001h
IPR5_CCH05_MASK                          equ 0001h
IPR5_CCH15_POSN                          equ 0001h
IPR5_CCH15_POSITION                      equ 0001h
IPR5_CCH15_SIZE                          equ 0001h
IPR5_CCH15_LENGTH                        equ 0001h
IPR5_CCH15_MASK                          equ 0002h
IPR5_EVPOL05_POSN                        equ 0003h
IPR5_EVPOL05_POSITION                    equ 0003h
IPR5_EVPOL05_SIZE                        equ 0001h
IPR5_EVPOL05_LENGTH                      equ 0001h
IPR5_EVPOL05_MASK                        equ 0008h
IPR5_EVPOL15_POSN                        equ 0004h
IPR5_EVPOL15_POSITION                    equ 0004h
IPR5_EVPOL15_SIZE                        equ 0001h
IPR5_EVPOL15_LENGTH                      equ 0001h
IPR5_EVPOL15_MASK                        equ 0010h

// Register: IPR6
#define IPR6 IPR6
IPR6                                     equ 0E25h
// bitfield definitions
IPR6_TMR1GIP_POSN                        equ 0000h
IPR6_TMR1GIP_POSITION                    equ 0000h
IPR6_TMR1GIP_SIZE                        equ 0001h
IPR6_TMR1GIP_LENGTH                      equ 0001h
IPR6_TMR1GIP_MASK                        equ 0001h
IPR6_TMR3GIP_POSN                        equ 0001h
IPR6_TMR3GIP_POSITION                    equ 0001h
IPR6_TMR3GIP_SIZE                        equ 0001h
IPR6_TMR3GIP_LENGTH                      equ 0001h
IPR6_TMR3GIP_MASK                        equ 0002h
IPR6_TMR5GIP_POSN                        equ 0002h
IPR6_TMR5GIP_POSITION                    equ 0002h
IPR6_TMR5GIP_SIZE                        equ 0001h
IPR6_TMR5GIP_LENGTH                      equ 0001h
IPR6_TMR5GIP_MASK                        equ 0004h
IPR6_TMR7GIP_POSN                        equ 0003h
IPR6_TMR7GIP_POSITION                    equ 0003h
IPR6_TMR7GIP_SIZE                        equ 0001h
IPR6_TMR7GIP_LENGTH                      equ 0001h
IPR6_TMR7GIP_MASK                        equ 0008h

// Register: IPR7
#define IPR7 IPR7
IPR7                                     equ 0E26h
// bitfield definitions
IPR7_CCP1IP_POSN                         equ 0000h
IPR7_CCP1IP_POSITION                     equ 0000h
IPR7_CCP1IP_SIZE                         equ 0001h
IPR7_CCP1IP_LENGTH                       equ 0001h
IPR7_CCP1IP_MASK                         equ 0001h
IPR7_CCP2IP_POSN                         equ 0001h
IPR7_CCP2IP_POSITION                     equ 0001h
IPR7_CCP2IP_SIZE                         equ 0001h
IPR7_CCP2IP_LENGTH                       equ 0001h
IPR7_CCP2IP_MASK                         equ 0002h
IPR7_CCP3IP_POSN                         equ 0002h
IPR7_CCP3IP_POSITION                     equ 0002h
IPR7_CCP3IP_SIZE                         equ 0001h
IPR7_CCP3IP_LENGTH                       equ 0001h
IPR7_CCP3IP_MASK                         equ 0004h
IPR7_CCP4IP_POSN                         equ 0003h
IPR7_CCP4IP_POSITION                     equ 0003h
IPR7_CCP4IP_SIZE                         equ 0001h
IPR7_CCP4IP_LENGTH                       equ 0001h
IPR7_CCP4IP_MASK                         equ 0008h
IPR7_CCP5IP_POSN                         equ 0004h
IPR7_CCP5IP_POSITION                     equ 0004h
IPR7_CCP5IP_SIZE                         equ 0001h
IPR7_CCP5IP_LENGTH                       equ 0001h
IPR7_CCP5IP_MASK                         equ 0010h

// Register: IPR8
#define IPR8 IPR8
IPR8                                     equ 0E27h
// bitfield definitions
IPR8_CWG1IP_POSN                         equ 0000h
IPR8_CWG1IP_POSITION                     equ 0000h
IPR8_CWG1IP_SIZE                         equ 0001h
IPR8_CWG1IP_LENGTH                       equ 0001h
IPR8_CWG1IP_MASK                         equ 0001h
IPR8_NVMIP_POSN                          equ 0005h
IPR8_NVMIP_POSITION                      equ 0005h
IPR8_NVMIP_SIZE                          equ 0001h
IPR8_NVMIP_LENGTH                        equ 0001h
IPR8_NVMIP_MASK                          equ 0020h
IPR8_CRCIP_POSN                          equ 0006h
IPR8_CRCIP_POSITION                      equ 0006h
IPR8_CRCIP_SIZE                          equ 0001h
IPR8_CRCIP_LENGTH                        equ 0001h
IPR8_CRCIP_MASK                          equ 0040h
IPR8_SCANIP_POSN                         equ 0007h
IPR8_SCANIP_POSITION                     equ 0007h
IPR8_SCANIP_SIZE                         equ 0001h
IPR8_SCANIP_LENGTH                       equ 0001h
IPR8_SCANIP_MASK                         equ 0080h

// Register: IPR9
#define IPR9 IPR9
IPR9                                     equ 0E28h
// bitfield definitions
IPR9_SMT1IP_POSN                         equ 0000h
IPR9_SMT1IP_POSITION                     equ 0000h
IPR9_SMT1IP_SIZE                         equ 0001h
IPR9_SMT1IP_LENGTH                       equ 0001h
IPR9_SMT1IP_MASK                         equ 0001h
IPR9_SMT1PRAIP_POSN                      equ 0001h
IPR9_SMT1PRAIP_POSITION                  equ 0001h
IPR9_SMT1PRAIP_SIZE                      equ 0001h
IPR9_SMT1PRAIP_LENGTH                    equ 0001h
IPR9_SMT1PRAIP_MASK                      equ 0002h
IPR9_SMT1PWAIP_POSN                      equ 0002h
IPR9_SMT1PWAIP_POSITION                  equ 0002h
IPR9_SMT1PWAIP_SIZE                      equ 0001h
IPR9_SMT1PWAIP_LENGTH                    equ 0001h
IPR9_SMT1PWAIP_MASK                      equ 0004h
IPR9_SMT2IP_POSN                         equ 0003h
IPR9_SMT2IP_POSITION                     equ 0003h
IPR9_SMT2IP_SIZE                         equ 0001h
IPR9_SMT2IP_LENGTH                       equ 0001h
IPR9_SMT2IP_MASK                         equ 0008h
IPR9_SMT2PRAIP_POSN                      equ 0004h
IPR9_SMT2PRAIP_POSITION                  equ 0004h
IPR9_SMT2PRAIP_SIZE                      equ 0001h
IPR9_SMT2PRAIP_LENGTH                    equ 0001h
IPR9_SMT2PRAIP_MASK                      equ 0010h
IPR9_SMT2PWAIP_POSN                      equ 0005h
IPR9_SMT2PWAIP_POSITION                  equ 0005h
IPR9_SMT2PWAIP_SIZE                      equ 0001h
IPR9_SMT2PWAIP_LENGTH                    equ 0001h
IPR9_SMT2PWAIP_MASK                      equ 0020h

// Register: PIE0
#define PIE0 PIE0
PIE0                                     equ 0E29h
// bitfield definitions
PIE0_INT0IE_POSN                         equ 0000h
PIE0_INT0IE_POSITION                     equ 0000h
PIE0_INT0IE_SIZE                         equ 0001h
PIE0_INT0IE_LENGTH                       equ 0001h
PIE0_INT0IE_MASK                         equ 0001h
PIE0_INT1IE_POSN                         equ 0001h
PIE0_INT1IE_POSITION                     equ 0001h
PIE0_INT1IE_SIZE                         equ 0001h
PIE0_INT1IE_LENGTH                       equ 0001h
PIE0_INT1IE_MASK                         equ 0002h
PIE0_INT2IE_POSN                         equ 0002h
PIE0_INT2IE_POSITION                     equ 0002h
PIE0_INT2IE_SIZE                         equ 0001h
PIE0_INT2IE_LENGTH                       equ 0001h
PIE0_INT2IE_MASK                         equ 0004h
PIE0_INT3IE_POSN                         equ 0003h
PIE0_INT3IE_POSITION                     equ 0003h
PIE0_INT3IE_SIZE                         equ 0001h
PIE0_INT3IE_LENGTH                       equ 0001h
PIE0_INT3IE_MASK                         equ 0008h
PIE0_IOCIE_POSN                          equ 0004h
PIE0_IOCIE_POSITION                      equ 0004h
PIE0_IOCIE_SIZE                          equ 0001h
PIE0_IOCIE_LENGTH                        equ 0001h
PIE0_IOCIE_MASK                          equ 0010h
PIE0_TMR0IE_POSN                         equ 0005h
PIE0_TMR0IE_POSITION                     equ 0005h
PIE0_TMR0IE_SIZE                         equ 0001h
PIE0_TMR0IE_LENGTH                       equ 0001h
PIE0_TMR0IE_MASK                         equ 0020h

// Register: PIE1
#define PIE1 PIE1
PIE1                                     equ 0E2Ah
// bitfield definitions
PIE1_ADIE_POSN                           equ 0000h
PIE1_ADIE_POSITION                       equ 0000h
PIE1_ADIE_SIZE                           equ 0001h
PIE1_ADIE_LENGTH                         equ 0001h
PIE1_ADIE_MASK                           equ 0001h
PIE1_ADTIE_POSN                          equ 0001h
PIE1_ADTIE_POSITION                      equ 0001h
PIE1_ADTIE_SIZE                          equ 0001h
PIE1_ADTIE_LENGTH                        equ 0001h
PIE1_ADTIE_MASK                          equ 0002h
PIE1_CSWIE_POSN                          equ 0006h
PIE1_CSWIE_POSITION                      equ 0006h
PIE1_CSWIE_SIZE                          equ 0001h
PIE1_CSWIE_LENGTH                        equ 0001h
PIE1_CSWIE_MASK                          equ 0040h
PIE1_OSCFIE_POSN                         equ 0007h
PIE1_OSCFIE_POSITION                     equ 0007h
PIE1_OSCFIE_SIZE                         equ 0001h
PIE1_OSCFIE_LENGTH                       equ 0001h
PIE1_OSCFIE_MASK                         equ 0080h
PIE1_PSPIE_POSN                          equ 0007h
PIE1_PSPIE_POSITION                      equ 0007h
PIE1_PSPIE_SIZE                          equ 0001h
PIE1_PSPIE_LENGTH                        equ 0001h
PIE1_PSPIE_MASK                          equ 0080h

// Register: PIE2
#define PIE2 PIE2
PIE2                                     equ 0E2Bh
// bitfield definitions
PIE2_C1IE_POSN                           equ 0000h
PIE2_C1IE_POSITION                       equ 0000h
PIE2_C1IE_SIZE                           equ 0001h
PIE2_C1IE_LENGTH                         equ 0001h
PIE2_C1IE_MASK                           equ 0001h
PIE2_C2IE_POSN                           equ 0001h
PIE2_C2IE_POSITION                       equ 0001h
PIE2_C2IE_SIZE                           equ 0001h
PIE2_C2IE_LENGTH                         equ 0001h
PIE2_C2IE_MASK                           equ 0002h
PIE2_C3IE_POSN                           equ 0002h
PIE2_C3IE_POSITION                       equ 0002h
PIE2_C3IE_SIZE                           equ 0001h
PIE2_C3IE_LENGTH                         equ 0001h
PIE2_C3IE_MASK                           equ 0004h
PIE2_ZCDIE_POSN                          equ 0006h
PIE2_ZCDIE_POSITION                      equ 0006h
PIE2_ZCDIE_SIZE                          equ 0001h
PIE2_ZCDIE_LENGTH                        equ 0001h
PIE2_ZCDIE_MASK                          equ 0040h
PIE2_HLVDIE_POSN                         equ 0007h
PIE2_HLVDIE_POSITION                     equ 0007h
PIE2_HLVDIE_SIZE                         equ 0001h
PIE2_HLVDIE_LENGTH                       equ 0001h
PIE2_HLVDIE_MASK                         equ 0080h
PIE2_CMIE_POSN                           equ 0006h
PIE2_CMIE_POSITION                       equ 0006h
PIE2_CMIE_SIZE                           equ 0001h
PIE2_CMIE_LENGTH                         equ 0001h
PIE2_CMIE_MASK                           equ 0040h

// Register: PIE3
#define PIE3 PIE3
PIE3                                     equ 0E2Ch
// bitfield definitions
PIE3_SSP1IE_POSN                         equ 0000h
PIE3_SSP1IE_POSITION                     equ 0000h
PIE3_SSP1IE_SIZE                         equ 0001h
PIE3_SSP1IE_LENGTH                       equ 0001h
PIE3_SSP1IE_MASK                         equ 0001h
PIE3_BCL1IE_POSN                         equ 0001h
PIE3_BCL1IE_POSITION                     equ 0001h
PIE3_BCL1IE_SIZE                         equ 0001h
PIE3_BCL1IE_LENGTH                       equ 0001h
PIE3_BCL1IE_MASK                         equ 0002h
PIE3_SSP2IE_POSN                         equ 0002h
PIE3_SSP2IE_POSITION                     equ 0002h
PIE3_SSP2IE_SIZE                         equ 0001h
PIE3_SSP2IE_LENGTH                       equ 0001h
PIE3_SSP2IE_MASK                         equ 0004h
PIE3_BCL2IE_POSN                         equ 0003h
PIE3_BCL2IE_POSITION                     equ 0003h
PIE3_BCL2IE_SIZE                         equ 0001h
PIE3_BCL2IE_LENGTH                       equ 0001h
PIE3_BCL2IE_MASK                         equ 0008h
PIE3_TX1IE_POSN                          equ 0004h
PIE3_TX1IE_POSITION                      equ 0004h
PIE3_TX1IE_SIZE                          equ 0001h
PIE3_TX1IE_LENGTH                        equ 0001h
PIE3_TX1IE_MASK                          equ 0010h
PIE3_RC1IE_POSN                          equ 0005h
PIE3_RC1IE_POSITION                      equ 0005h
PIE3_RC1IE_SIZE                          equ 0001h
PIE3_RC1IE_LENGTH                        equ 0001h
PIE3_RC1IE_MASK                          equ 0020h
PIE3_TX2IE_POSN                          equ 0006h
PIE3_TX2IE_POSITION                      equ 0006h
PIE3_TX2IE_SIZE                          equ 0001h
PIE3_TX2IE_LENGTH                        equ 0001h
PIE3_TX2IE_MASK                          equ 0040h
PIE3_RC2IE_POSN                          equ 0007h
PIE3_RC2IE_POSITION                      equ 0007h
PIE3_RC2IE_SIZE                          equ 0001h
PIE3_RC2IE_LENGTH                        equ 0001h
PIE3_RC2IE_MASK                          equ 0080h
PIE3_RXB0IE_POSN                         equ 0000h
PIE3_RXB0IE_POSITION                     equ 0000h
PIE3_RXB0IE_SIZE                         equ 0001h
PIE3_RXB0IE_LENGTH                       equ 0001h
PIE3_RXB0IE_MASK                         equ 0001h
PIE3_RXB1IE_POSN                         equ 0001h
PIE3_RXB1IE_POSITION                     equ 0001h
PIE3_RXB1IE_SIZE                         equ 0001h
PIE3_RXB1IE_LENGTH                       equ 0001h
PIE3_RXB1IE_MASK                         equ 0002h
PIE3_TXB0IE_POSN                         equ 0002h
PIE3_TXB0IE_POSITION                     equ 0002h
PIE3_TXB0IE_SIZE                         equ 0001h
PIE3_TXB0IE_LENGTH                       equ 0001h
PIE3_TXB0IE_MASK                         equ 0004h
PIE3_TXB1IE_POSN                         equ 0003h
PIE3_TXB1IE_POSITION                     equ 0003h
PIE3_TXB1IE_SIZE                         equ 0001h
PIE3_TXB1IE_LENGTH                       equ 0001h
PIE3_TXB1IE_MASK                         equ 0008h
PIE3_TXB2IE_POSN                         equ 0004h
PIE3_TXB2IE_POSITION                     equ 0004h
PIE3_TXB2IE_SIZE                         equ 0001h
PIE3_TXB2IE_LENGTH                       equ 0001h
PIE3_TXB2IE_MASK                         equ 0010h
PIE3_RXBNIE_POSN                         equ 0001h
PIE3_RXBNIE_POSITION                     equ 0001h
PIE3_RXBNIE_SIZE                         equ 0001h
PIE3_RXBNIE_LENGTH                       equ 0001h
PIE3_RXBNIE_MASK                         equ 0002h
PIE3_TXBNIE_POSN                         equ 0004h
PIE3_TXBNIE_POSITION                     equ 0004h
PIE3_TXBNIE_SIZE                         equ 0001h
PIE3_TXBNIE_LENGTH                       equ 0001h
PIE3_TXBNIE_MASK                         equ 0010h

