GopalSaraf/Practicals/PSDL/include/proc/pic18f66k40.inc
// Register: PMD2
#define PMD2 PMD2
PMD2                                     equ 0E4Eh
// bitfield definitions
PMD2_TMR8MD_POSN                         equ 0000h
PMD2_TMR8MD_POSITION                     equ 0000h
PMD2_TMR8MD_SIZE                         equ 0001h
PMD2_TMR8MD_LENGTH                       equ 0001h
PMD2_TMR8MD_MASK                         equ 0001h
PMD2_SMU1MD_POSN                         equ 0001h
PMD2_SMU1MD_POSITION                     equ 0001h
PMD2_SMU1MD_SIZE                         equ 0001h
PMD2_SMU1MD_LENGTH                       equ 0001h
PMD2_SMU1MD_MASK                         equ 0002h
PMD2_SMU2MD_POSN                         equ 0002h
PMD2_SMU2MD_POSITION                     equ 0002h
PMD2_SMU2MD_SIZE                         equ 0001h
PMD2_SMU2MD_LENGTH                       equ 0001h
PMD2_SMU2MD_MASK                         equ 0004h
PMD2_DSMMD_POSN                          equ 0003h
PMD2_DSMMD_POSITION                      equ 0003h
PMD2_DSMMD_SIZE                          equ 0001h
PMD2_DSMMD_LENGTH                        equ 0001h
PMD2_DSMMD_MASK                          equ 0008h
PMD2_CWGMD_POSN                          equ 0005h
PMD2_CWGMD_POSITION                      equ 0005h
PMD2_CWGMD_SIZE                          equ 0001h
PMD2_CWGMD_LENGTH                        equ 0001h
PMD2_CWGMD_MASK                          equ 0020h
PMD2_CWG1MD_POSN                         equ 0005h
PMD2_CWG1MD_POSITION                     equ 0005h
PMD2_CWG1MD_SIZE                         equ 0001h
PMD2_CWG1MD_LENGTH                       equ 0001h
PMD2_CWG1MD_MASK                         equ 0020h

// Register: PMD3
#define PMD3 PMD3
PMD3                                     equ 0E4Fh
// bitfield definitions
PMD3_ZCDMD_POSN                          equ 0000h
PMD3_ZCDMD_POSITION                      equ 0000h
PMD3_ZCDMD_SIZE                          equ 0001h
PMD3_ZCDMD_LENGTH                        equ 0001h
PMD3_ZCDMD_MASK                          equ 0001h
PMD3_CMP1MD_POSN                         equ 0001h
PMD3_CMP1MD_POSITION                     equ 0001h
PMD3_CMP1MD_SIZE                         equ 0001h
PMD3_CMP1MD_LENGTH                       equ 0001h
PMD3_CMP1MD_MASK                         equ 0002h
PMD3_CMP2MD_POSN                         equ 0002h
PMD3_CMP2MD_POSITION                     equ 0002h
PMD3_CMP2MD_SIZE                         equ 0001h
PMD3_CMP2MD_LENGTH                       equ 0001h
PMD3_CMP2MD_MASK                         equ 0004h
PMD3_CMP3MD_POSN                         equ 0003h
PMD3_CMP3MD_POSITION                     equ 0003h
PMD3_CMP3MD_SIZE                         equ 0001h
PMD3_CMP3MD_LENGTH                       equ 0001h
PMD3_CMP3MD_MASK                         equ 0008h
PMD3_ADCMD_POSN                          equ 0005h
PMD3_ADCMD_POSITION                      equ 0005h
PMD3_ADCMD_SIZE                          equ 0001h
PMD3_ADCMD_LENGTH                        equ 0001h
PMD3_ADCMD_MASK                          equ 0020h
PMD3_DACMD_POSN                          equ 0006h
PMD3_DACMD_POSITION                      equ 0006h
PMD3_DACMD_SIZE                          equ 0001h
PMD3_DACMD_LENGTH                        equ 0001h
PMD3_DACMD_MASK                          equ 0040h

// Register: PMD4
#define PMD4 PMD4
PMD4                                     equ 0E50h
// bitfield definitions
PMD4_CCP1MD_POSN                         equ 0000h
PMD4_CCP1MD_POSITION                     equ 0000h
PMD4_CCP1MD_SIZE                         equ 0001h
PMD4_CCP1MD_LENGTH                       equ 0001h
PMD4_CCP1MD_MASK                         equ 0001h
PMD4_CCP2MD_POSN                         equ 0001h
PMD4_CCP2MD_POSITION                     equ 0001h
PMD4_CCP2MD_SIZE                         equ 0001h
PMD4_CCP2MD_LENGTH                       equ 0001h
PMD4_CCP2MD_MASK                         equ 0002h
PMD4_CCP3MD_POSN                         equ 0002h
PMD4_CCP3MD_POSITION                     equ 0002h
PMD4_CCP3MD_SIZE                         equ 0001h
PMD4_CCP3MD_LENGTH                       equ 0001h
PMD4_CCP3MD_MASK                         equ 0004h
PMD4_CCP4MD_POSN                         equ 0003h
PMD4_CCP4MD_POSITION                     equ 0003h
PMD4_CCP4MD_SIZE                         equ 0001h
PMD4_CCP4MD_LENGTH                       equ 0001h
PMD4_CCP4MD_MASK                         equ 0008h
PMD4_CCP5MD_POSN                         equ 0004h
PMD4_CCP5MD_POSITION                     equ 0004h
PMD4_CCP5MD_SIZE                         equ 0001h
PMD4_CCP5MD_LENGTH                       equ 0001h
PMD4_CCP5MD_MASK                         equ 0010h
PMD4_PWM6MD_POSN                         equ 0005h
PMD4_PWM6MD_POSITION                     equ 0005h
PMD4_PWM6MD_SIZE                         equ 0001h
PMD4_PWM6MD_LENGTH                       equ 0001h
PMD4_PWM6MD_MASK                         equ 0020h
PMD4_PWM7MD_POSN                         equ 0006h
PMD4_PWM7MD_POSITION                     equ 0006h
PMD4_PWM7MD_SIZE                         equ 0001h
PMD4_PWM7MD_LENGTH                       equ 0001h
PMD4_PWM7MD_MASK                         equ 0040h

// Register: PMD5
#define PMD5 PMD5
PMD5                                     equ 0E51h
// bitfield definitions
PMD5_MSSP1MD_POSN                        equ 0000h
PMD5_MSSP1MD_POSITION                    equ 0000h
PMD5_MSSP1MD_SIZE                        equ 0001h
PMD5_MSSP1MD_LENGTH                      equ 0001h
PMD5_MSSP1MD_MASK                        equ 0001h
PMD5_MSSP2MD_POSN                        equ 0001h
PMD5_MSSP2MD_POSITION                    equ 0001h
PMD5_MSSP2MD_SIZE                        equ 0001h
PMD5_MSSP2MD_LENGTH                      equ 0001h
PMD5_MSSP2MD_MASK                        equ 0002h
PMD5_UART1MD_POSN                        equ 0002h
PMD5_UART1MD_POSITION                    equ 0002h
PMD5_UART1MD_SIZE                        equ 0001h
PMD5_UART1MD_LENGTH                      equ 0001h
PMD5_UART1MD_MASK                        equ 0004h
PMD5_UART2MD_POSN                        equ 0003h
PMD5_UART2MD_POSITION                    equ 0003h
PMD5_UART2MD_SIZE                        equ 0001h
PMD5_UART2MD_LENGTH                      equ 0001h
PMD5_UART2MD_MASK                        equ 0008h
PMD5_UART3MD_POSN                        equ 0004h
PMD5_UART3MD_POSITION                    equ 0004h
PMD5_UART3MD_SIZE                        equ 0001h
PMD5_UART3MD_LENGTH                      equ 0001h
PMD5_UART3MD_MASK                        equ 0010h
PMD5_UART4MD_POSN                        equ 0005h
PMD5_UART4MD_POSITION                    equ 0005h
PMD5_UART4MD_SIZE                        equ 0001h
PMD5_UART4MD_LENGTH                      equ 0001h
PMD5_UART4MD_MASK                        equ 0020h
PMD5_UART5MD_POSN                        equ 0006h
PMD5_UART5MD_POSITION                    equ 0006h
PMD5_UART5MD_SIZE                        equ 0001h
PMD5_UART5MD_LENGTH                      equ 0001h
PMD5_UART5MD_MASK                        equ 0040h

// Register: RA0PPS
#define RA0PPS RA0PPS
RA0PPS                                   equ 0E52h
// bitfield definitions
RA0PPS_RA0PPS0_POSN                      equ 0000h
RA0PPS_RA0PPS0_POSITION                  equ 0000h
RA0PPS_RA0PPS0_SIZE                      equ 0001h
RA0PPS_RA0PPS0_LENGTH                    equ 0001h
RA0PPS_RA0PPS0_MASK                      equ 0001h
RA0PPS_RA0PPS1_POSN                      equ 0001h
RA0PPS_RA0PPS1_POSITION                  equ 0001h
RA0PPS_RA0PPS1_SIZE                      equ 0001h
RA0PPS_RA0PPS1_LENGTH                    equ 0001h
RA0PPS_RA0PPS1_MASK                      equ 0002h
RA0PPS_RA0PPS2_POSN                      equ 0002h
RA0PPS_RA0PPS2_POSITION                  equ 0002h
RA0PPS_RA0PPS2_SIZE                      equ 0001h
RA0PPS_RA0PPS2_LENGTH                    equ 0001h
RA0PPS_RA0PPS2_MASK                      equ 0004h
RA0PPS_RA0PPS3_POSN                      equ 0003h
RA0PPS_RA0PPS3_POSITION                  equ 0003h
RA0PPS_RA0PPS3_SIZE                      equ 0001h
RA0PPS_RA0PPS3_LENGTH                    equ 0001h
RA0PPS_RA0PPS3_MASK                      equ 0008h
RA0PPS_RA0PPS4_POSN                      equ 0004h
RA0PPS_RA0PPS4_POSITION                  equ 0004h
RA0PPS_RA0PPS4_SIZE                      equ 0001h
RA0PPS_RA0PPS4_LENGTH                    equ 0001h
RA0PPS_RA0PPS4_MASK                      equ 0010h
RA0PPS_RA0PPS5_POSN                      equ 0005h
RA0PPS_RA0PPS5_POSITION                  equ 0005h
RA0PPS_RA0PPS5_SIZE                      equ 0001h
RA0PPS_RA0PPS5_LENGTH                    equ 0001h
RA0PPS_RA0PPS5_MASK                      equ 0020h

// Register: RA1PPS
#define RA1PPS RA1PPS
RA1PPS                                   equ 0E53h
// bitfield definitions
RA1PPS_RA1PPS0_POSN                      equ 0000h
RA1PPS_RA1PPS0_POSITION                  equ 0000h
RA1PPS_RA1PPS0_SIZE                      equ 0001h
RA1PPS_RA1PPS0_LENGTH                    equ 0001h
RA1PPS_RA1PPS0_MASK                      equ 0001h
RA1PPS_RA1PPS1_POSN                      equ 0001h
RA1PPS_RA1PPS1_POSITION                  equ 0001h
RA1PPS_RA1PPS1_SIZE                      equ 0001h
RA1PPS_RA1PPS1_LENGTH                    equ 0001h
RA1PPS_RA1PPS1_MASK                      equ 0002h
RA1PPS_RA1PPS2_POSN                      equ 0002h
RA1PPS_RA1PPS2_POSITION                  equ 0002h
RA1PPS_RA1PPS2_SIZE                      equ 0001h
RA1PPS_RA1PPS2_LENGTH                    equ 0001h
RA1PPS_RA1PPS2_MASK                      equ 0004h
RA1PPS_RA1PPS3_POSN                      equ 0003h
RA1PPS_RA1PPS3_POSITION                  equ 0003h
RA1PPS_RA1PPS3_SIZE                      equ 0001h
RA1PPS_RA1PPS3_LENGTH                    equ 0001h
RA1PPS_RA1PPS3_MASK                      equ 0008h
RA1PPS_RA1PPS4_POSN                      equ 0004h
RA1PPS_RA1PPS4_POSITION                  equ 0004h
RA1PPS_RA1PPS4_SIZE                      equ 0001h
RA1PPS_RA1PPS4_LENGTH                    equ 0001h
RA1PPS_RA1PPS4_MASK                      equ 0010h
RA1PPS_RA1PPS5_POSN                      equ 0005h
RA1PPS_RA1PPS5_POSITION                  equ 0005h
RA1PPS_RA1PPS5_SIZE                      equ 0001h
RA1PPS_RA1PPS5_LENGTH                    equ 0001h
RA1PPS_RA1PPS5_MASK                      equ 0020h

// Register: RA2PPS
#define RA2PPS RA2PPS
RA2PPS                                   equ 0E54h
// bitfield definitions
RA2PPS_RA2PPS0_POSN                      equ 0000h
RA2PPS_RA2PPS0_POSITION                  equ 0000h
RA2PPS_RA2PPS0_SIZE                      equ 0001h
RA2PPS_RA2PPS0_LENGTH                    equ 0001h
RA2PPS_RA2PPS0_MASK                      equ 0001h
RA2PPS_RA2PPS1_POSN                      equ 0001h
RA2PPS_RA2PPS1_POSITION                  equ 0001h
RA2PPS_RA2PPS1_SIZE                      equ 0001h
RA2PPS_RA2PPS1_LENGTH                    equ 0001h
RA2PPS_RA2PPS1_MASK                      equ 0002h
RA2PPS_RA2PPS2_POSN                      equ 0002h
RA2PPS_RA2PPS2_POSITION                  equ 0002h
RA2PPS_RA2PPS2_SIZE                      equ 0001h
RA2PPS_RA2PPS2_LENGTH                    equ 0001h
RA2PPS_RA2PPS2_MASK                      equ 0004h
RA2PPS_RA2PPS3_POSN                      equ 0003h
RA2PPS_RA2PPS3_POSITION                  equ 0003h
RA2PPS_RA2PPS3_SIZE                      equ 0001h
RA2PPS_RA2PPS3_LENGTH                    equ 0001h
RA2PPS_RA2PPS3_MASK                      equ 0008h
RA2PPS_RA2PPS4_POSN                      equ 0004h
RA2PPS_RA2PPS4_POSITION                  equ 0004h
RA2PPS_RA2PPS4_SIZE                      equ 0001h
RA2PPS_RA2PPS4_LENGTH                    equ 0001h
RA2PPS_RA2PPS4_MASK                      equ 0010h
RA2PPS_RA2PPS5_POSN                      equ 0005h
RA2PPS_RA2PPS5_POSITION                  equ 0005h
RA2PPS_RA2PPS5_SIZE                      equ 0001h
RA2PPS_RA2PPS5_LENGTH                    equ 0001h
RA2PPS_RA2PPS5_MASK                      equ 0020h

