GopalSaraf/Practicals/PSDL/include/proc/pic18f66k40.inc
// Register: RG3PPS
#define RG3PPS RG3PPS
RG3PPS                                   equ 0E85h
// bitfield definitions
RG3PPS_RG3PPS0_POSN                      equ 0000h
RG3PPS_RG3PPS0_POSITION                  equ 0000h
RG3PPS_RG3PPS0_SIZE                      equ 0001h
RG3PPS_RG3PPS0_LENGTH                    equ 0001h
RG3PPS_RG3PPS0_MASK                      equ 0001h
RG3PPS_RG3PPS1_POSN                      equ 0001h
RG3PPS_RG3PPS1_POSITION                  equ 0001h
RG3PPS_RG3PPS1_SIZE                      equ 0001h
RG3PPS_RG3PPS1_LENGTH                    equ 0001h
RG3PPS_RG3PPS1_MASK                      equ 0002h
RG3PPS_RG3PPS2_POSN                      equ 0002h
RG3PPS_RG3PPS2_POSITION                  equ 0002h
RG3PPS_RG3PPS2_SIZE                      equ 0001h
RG3PPS_RG3PPS2_LENGTH                    equ 0001h
RG3PPS_RG3PPS2_MASK                      equ 0004h
RG3PPS_RG3PPS3_POSN                      equ 0003h
RG3PPS_RG3PPS3_POSITION                  equ 0003h
RG3PPS_RG3PPS3_SIZE                      equ 0001h
RG3PPS_RG3PPS3_LENGTH                    equ 0001h
RG3PPS_RG3PPS3_MASK                      equ 0008h
RG3PPS_RG3PPS4_POSN                      equ 0004h
RG3PPS_RG3PPS4_POSITION                  equ 0004h
RG3PPS_RG3PPS4_SIZE                      equ 0001h
RG3PPS_RG3PPS4_LENGTH                    equ 0001h
RG3PPS_RG3PPS4_MASK                      equ 0010h
RG3PPS_RG3PPS5_POSN                      equ 0005h
RG3PPS_RG3PPS5_POSITION                  equ 0005h
RG3PPS_RG3PPS5_SIZE                      equ 0001h
RG3PPS_RG3PPS5_LENGTH                    equ 0001h
RG3PPS_RG3PPS5_MASK                      equ 0020h

// Register: RG4PPS
#define RG4PPS RG4PPS
RG4PPS                                   equ 0E86h
// bitfield definitions
RG4PPS_RG4PPS0_POSN                      equ 0000h
RG4PPS_RG4PPS0_POSITION                  equ 0000h
RG4PPS_RG4PPS0_SIZE                      equ 0001h
RG4PPS_RG4PPS0_LENGTH                    equ 0001h
RG4PPS_RG4PPS0_MASK                      equ 0001h
RG4PPS_RG4PPS1_POSN                      equ 0001h
RG4PPS_RG4PPS1_POSITION                  equ 0001h
RG4PPS_RG4PPS1_SIZE                      equ 0001h
RG4PPS_RG4PPS1_LENGTH                    equ 0001h
RG4PPS_RG4PPS1_MASK                      equ 0002h
RG4PPS_RG4PPS2_POSN                      equ 0002h
RG4PPS_RG4PPS2_POSITION                  equ 0002h
RG4PPS_RG4PPS2_SIZE                      equ 0001h
RG4PPS_RG4PPS2_LENGTH                    equ 0001h
RG4PPS_RG4PPS2_MASK                      equ 0004h
RG4PPS_RG4PPS3_POSN                      equ 0003h
RG4PPS_RG4PPS3_POSITION                  equ 0003h
RG4PPS_RG4PPS3_SIZE                      equ 0001h
RG4PPS_RG4PPS3_LENGTH                    equ 0001h
RG4PPS_RG4PPS3_MASK                      equ 0008h
RG4PPS_RG4PPS4_POSN                      equ 0004h
RG4PPS_RG4PPS4_POSITION                  equ 0004h
RG4PPS_RG4PPS4_SIZE                      equ 0001h
RG4PPS_RG4PPS4_LENGTH                    equ 0001h
RG4PPS_RG4PPS4_MASK                      equ 0010h
RG4PPS_RG4PPS5_POSN                      equ 0005h
RG4PPS_RG4PPS5_POSITION                  equ 0005h
RG4PPS_RG4PPS5_SIZE                      equ 0001h
RG4PPS_RG4PPS5_LENGTH                    equ 0001h
RG4PPS_RG4PPS5_MASK                      equ 0020h

// Register: RG6PPS
#define RG6PPS RG6PPS
RG6PPS                                   equ 0E88h
// bitfield definitions
RG6PPS_RG6PPS0_POSN                      equ 0000h
RG6PPS_RG6PPS0_POSITION                  equ 0000h
RG6PPS_RG6PPS0_SIZE                      equ 0001h
RG6PPS_RG6PPS0_LENGTH                    equ 0001h
RG6PPS_RG6PPS0_MASK                      equ 0001h
RG6PPS_RG6PPS1_POSN                      equ 0001h
RG6PPS_RG6PPS1_POSITION                  equ 0001h
RG6PPS_RG6PPS1_SIZE                      equ 0001h
RG6PPS_RG6PPS1_LENGTH                    equ 0001h
RG6PPS_RG6PPS1_MASK                      equ 0002h
RG6PPS_RG6PPS2_POSN                      equ 0002h
RG6PPS_RG6PPS2_POSITION                  equ 0002h
RG6PPS_RG6PPS2_SIZE                      equ 0001h
RG6PPS_RG6PPS2_LENGTH                    equ 0001h
RG6PPS_RG6PPS2_MASK                      equ 0004h
RG6PPS_RG6PPS3_POSN                      equ 0003h
RG6PPS_RG6PPS3_POSITION                  equ 0003h
RG6PPS_RG6PPS3_SIZE                      equ 0001h
RG6PPS_RG6PPS3_LENGTH                    equ 0001h
RG6PPS_RG6PPS3_MASK                      equ 0008h
RG6PPS_RG6PPS4_POSN                      equ 0004h
RG6PPS_RG6PPS4_POSITION                  equ 0004h
RG6PPS_RG6PPS4_SIZE                      equ 0001h
RG6PPS_RG6PPS4_LENGTH                    equ 0001h
RG6PPS_RG6PPS4_MASK                      equ 0010h
RG6PPS_RG6PPS5_POSN                      equ 0005h
RG6PPS_RG6PPS5_POSITION                  equ 0005h
RG6PPS_RG6PPS5_SIZE                      equ 0001h
RG6PPS_RG6PPS5_LENGTH                    equ 0001h
RG6PPS_RG6PPS5_MASK                      equ 0020h

// Register: RG7PPS
#define RG7PPS RG7PPS
RG7PPS                                   equ 0E89h
// bitfield definitions
RG7PPS_RG7PPS0_POSN                      equ 0000h
RG7PPS_RG7PPS0_POSITION                  equ 0000h
RG7PPS_RG7PPS0_SIZE                      equ 0001h
RG7PPS_RG7PPS0_LENGTH                    equ 0001h
RG7PPS_RG7PPS0_MASK                      equ 0001h
RG7PPS_RG7PPS1_POSN                      equ 0001h
RG7PPS_RG7PPS1_POSITION                  equ 0001h
RG7PPS_RG7PPS1_SIZE                      equ 0001h
RG7PPS_RG7PPS1_LENGTH                    equ 0001h
RG7PPS_RG7PPS1_MASK                      equ 0002h
RG7PPS_RG7PPS2_POSN                      equ 0002h
RG7PPS_RG7PPS2_POSITION                  equ 0002h
RG7PPS_RG7PPS2_SIZE                      equ 0001h
RG7PPS_RG7PPS2_LENGTH                    equ 0001h
RG7PPS_RG7PPS2_MASK                      equ 0004h
RG7PPS_RG7PPS3_POSN                      equ 0003h
RG7PPS_RG7PPS3_POSITION                  equ 0003h
RG7PPS_RG7PPS3_SIZE                      equ 0001h
RG7PPS_RG7PPS3_LENGTH                    equ 0001h
RG7PPS_RG7PPS3_MASK                      equ 0008h
RG7PPS_RG7PPS4_POSN                      equ 0004h
RG7PPS_RG7PPS4_POSITION                  equ 0004h
RG7PPS_RG7PPS4_SIZE                      equ 0001h
RG7PPS_RG7PPS4_LENGTH                    equ 0001h
RG7PPS_RG7PPS4_MASK                      equ 0010h
RG7PPS_RG7PPS5_POSN                      equ 0005h
RG7PPS_RG7PPS5_POSITION                  equ 0005h
RG7PPS_RG7PPS5_SIZE                      equ 0001h
RG7PPS_RG7PPS5_LENGTH                    equ 0001h
RG7PPS_RG7PPS5_MASK                      equ 0020h

// Register: RH0PPS
#define RH0PPS RH0PPS
RH0PPS                                   equ 0E8Ah
// bitfield definitions
RH0PPS_RH0PPS0_POSN                      equ 0000h
RH0PPS_RH0PPS0_POSITION                  equ 0000h
RH0PPS_RH0PPS0_SIZE                      equ 0001h
RH0PPS_RH0PPS0_LENGTH                    equ 0001h
RH0PPS_RH0PPS0_MASK                      equ 0001h
RH0PPS_RH0PPS1_POSN                      equ 0001h
RH0PPS_RH0PPS1_POSITION                  equ 0001h
RH0PPS_RH0PPS1_SIZE                      equ 0001h
RH0PPS_RH0PPS1_LENGTH                    equ 0001h
RH0PPS_RH0PPS1_MASK                      equ 0002h
RH0PPS_RH0PPS2_POSN                      equ 0002h
RH0PPS_RH0PPS2_POSITION                  equ 0002h
RH0PPS_RH0PPS2_SIZE                      equ 0001h
RH0PPS_RH0PPS2_LENGTH                    equ 0001h
RH0PPS_RH0PPS2_MASK                      equ 0004h
RH0PPS_RH0PPS3_POSN                      equ 0003h
RH0PPS_RH0PPS3_POSITION                  equ 0003h
RH0PPS_RH0PPS3_SIZE                      equ 0001h
RH0PPS_RH0PPS3_LENGTH                    equ 0001h
RH0PPS_RH0PPS3_MASK                      equ 0008h
RH0PPS_RH0PPS4_POSN                      equ 0004h
RH0PPS_RH0PPS4_POSITION                  equ 0004h
RH0PPS_RH0PPS4_SIZE                      equ 0001h
RH0PPS_RH0PPS4_LENGTH                    equ 0001h
RH0PPS_RH0PPS4_MASK                      equ 0010h
RH0PPS_RH0PPS5_POSN                      equ 0005h
RH0PPS_RH0PPS5_POSITION                  equ 0005h
RH0PPS_RH0PPS5_SIZE                      equ 0001h
RH0PPS_RH0PPS5_LENGTH                    equ 0001h
RH0PPS_RH0PPS5_MASK                      equ 0020h

// Register: RH1PPS
#define RH1PPS RH1PPS
RH1PPS                                   equ 0E8Bh
// bitfield definitions
RH1PPS_RH1PPS0_POSN                      equ 0000h
RH1PPS_RH1PPS0_POSITION                  equ 0000h
RH1PPS_RH1PPS0_SIZE                      equ 0001h
RH1PPS_RH1PPS0_LENGTH                    equ 0001h
RH1PPS_RH1PPS0_MASK                      equ 0001h
RH1PPS_RH1PPS1_POSN                      equ 0001h
RH1PPS_RH1PPS1_POSITION                  equ 0001h
RH1PPS_RH1PPS1_SIZE                      equ 0001h
RH1PPS_RH1PPS1_LENGTH                    equ 0001h
RH1PPS_RH1PPS1_MASK                      equ 0002h
RH1PPS_RH1PPS2_POSN                      equ 0002h
RH1PPS_RH1PPS2_POSITION                  equ 0002h
RH1PPS_RH1PPS2_SIZE                      equ 0001h
RH1PPS_RH1PPS2_LENGTH                    equ 0001h
RH1PPS_RH1PPS2_MASK                      equ 0004h
RH1PPS_RH1PPS3_POSN                      equ 0003h
RH1PPS_RH1PPS3_POSITION                  equ 0003h
RH1PPS_RH1PPS3_SIZE                      equ 0001h
RH1PPS_RH1PPS3_LENGTH                    equ 0001h
RH1PPS_RH1PPS3_MASK                      equ 0008h
RH1PPS_RH1PPS4_POSN                      equ 0004h
RH1PPS_RH1PPS4_POSITION                  equ 0004h
RH1PPS_RH1PPS4_SIZE                      equ 0001h
RH1PPS_RH1PPS4_LENGTH                    equ 0001h
RH1PPS_RH1PPS4_MASK                      equ 0010h
RH1PPS_RH1PPS5_POSN                      equ 0005h
RH1PPS_RH1PPS5_POSITION                  equ 0005h
RH1PPS_RH1PPS5_SIZE                      equ 0001h
RH1PPS_RH1PPS5_LENGTH                    equ 0001h
RH1PPS_RH1PPS5_MASK                      equ 0020h

