GopalSaraf/Practicals/PSDL/include/proc/pic18f66k40.inc
// Register: RH2PPS
#define RH2PPS RH2PPS
RH2PPS                                   equ 0E8Ch
// bitfield definitions
RH2PPS_RH2PPS0_POSN                      equ 0000h
RH2PPS_RH2PPS0_POSITION                  equ 0000h
RH2PPS_RH2PPS0_SIZE                      equ 0001h
RH2PPS_RH2PPS0_LENGTH                    equ 0001h
RH2PPS_RH2PPS0_MASK                      equ 0001h
RH2PPS_RH2PPS1_POSN                      equ 0001h
RH2PPS_RH2PPS1_POSITION                  equ 0001h
RH2PPS_RH2PPS1_SIZE                      equ 0001h
RH2PPS_RH2PPS1_LENGTH                    equ 0001h
RH2PPS_RH2PPS1_MASK                      equ 0002h
RH2PPS_RH2PPS2_POSN                      equ 0002h
RH2PPS_RH2PPS2_POSITION                  equ 0002h
RH2PPS_RH2PPS2_SIZE                      equ 0001h
RH2PPS_RH2PPS2_LENGTH                    equ 0001h
RH2PPS_RH2PPS2_MASK                      equ 0004h
RH2PPS_RH2PPS3_POSN                      equ 0003h
RH2PPS_RH2PPS3_POSITION                  equ 0003h
RH2PPS_RH2PPS3_SIZE                      equ 0001h
RH2PPS_RH2PPS3_LENGTH                    equ 0001h
RH2PPS_RH2PPS3_MASK                      equ 0008h
RH2PPS_RH2PPS4_POSN                      equ 0004h
RH2PPS_RH2PPS4_POSITION                  equ 0004h
RH2PPS_RH2PPS4_SIZE                      equ 0001h
RH2PPS_RH2PPS4_LENGTH                    equ 0001h
RH2PPS_RH2PPS4_MASK                      equ 0010h
RH2PPS_RH2PPS5_POSN                      equ 0005h
RH2PPS_RH2PPS5_POSITION                  equ 0005h
RH2PPS_RH2PPS5_SIZE                      equ 0001h
RH2PPS_RH2PPS5_LENGTH                    equ 0001h
RH2PPS_RH2PPS5_MASK                      equ 0020h

// Register: RH3PPS
#define RH3PPS RH3PPS
RH3PPS                                   equ 0E8Dh
// bitfield definitions
RH3PPS_RH3PPS0_POSN                      equ 0000h
RH3PPS_RH3PPS0_POSITION                  equ 0000h
RH3PPS_RH3PPS0_SIZE                      equ 0001h
RH3PPS_RH3PPS0_LENGTH                    equ 0001h
RH3PPS_RH3PPS0_MASK                      equ 0001h
RH3PPS_RH3PPS1_POSN                      equ 0001h
RH3PPS_RH3PPS1_POSITION                  equ 0001h
RH3PPS_RH3PPS1_SIZE                      equ 0001h
RH3PPS_RH3PPS1_LENGTH                    equ 0001h
RH3PPS_RH3PPS1_MASK                      equ 0002h
RH3PPS_RH3PPS2_POSN                      equ 0002h
RH3PPS_RH3PPS2_POSITION                  equ 0002h
RH3PPS_RH3PPS2_SIZE                      equ 0001h
RH3PPS_RH3PPS2_LENGTH                    equ 0001h
RH3PPS_RH3PPS2_MASK                      equ 0004h
RH3PPS_RH3PPS3_POSN                      equ 0003h
RH3PPS_RH3PPS3_POSITION                  equ 0003h
RH3PPS_RH3PPS3_SIZE                      equ 0001h
RH3PPS_RH3PPS3_LENGTH                    equ 0001h
RH3PPS_RH3PPS3_MASK                      equ 0008h
RH3PPS_RH3PPS4_POSN                      equ 0004h
RH3PPS_RH3PPS4_POSITION                  equ 0004h
RH3PPS_RH3PPS4_SIZE                      equ 0001h
RH3PPS_RH3PPS4_LENGTH                    equ 0001h
RH3PPS_RH3PPS4_MASK                      equ 0010h
RH3PPS_RH3PPS5_POSN                      equ 0005h
RH3PPS_RH3PPS5_POSITION                  equ 0005h
RH3PPS_RH3PPS5_SIZE                      equ 0001h
RH3PPS_RH3PPS5_LENGTH                    equ 0001h
RH3PPS_RH3PPS5_MASK                      equ 0020h

// Register: INLVLA
#define INLVLA INLVLA
INLVLA                                   equ 0E8Eh
// bitfield definitions
INLVLA_INLVLA0_POSN                      equ 0000h
INLVLA_INLVLA0_POSITION                  equ 0000h
INLVLA_INLVLA0_SIZE                      equ 0001h
INLVLA_INLVLA0_LENGTH                    equ 0001h
INLVLA_INLVLA0_MASK                      equ 0001h
INLVLA_INLVLA1_POSN                      equ 0001h
INLVLA_INLVLA1_POSITION                  equ 0001h
INLVLA_INLVLA1_SIZE                      equ 0001h
INLVLA_INLVLA1_LENGTH                    equ 0001h
INLVLA_INLVLA1_MASK                      equ 0002h
INLVLA_INLVLA2_POSN                      equ 0002h
INLVLA_INLVLA2_POSITION                  equ 0002h
INLVLA_INLVLA2_SIZE                      equ 0001h
INLVLA_INLVLA2_LENGTH                    equ 0001h
INLVLA_INLVLA2_MASK                      equ 0004h
INLVLA_INLVLA3_POSN                      equ 0003h
INLVLA_INLVLA3_POSITION                  equ 0003h
INLVLA_INLVLA3_SIZE                      equ 0001h
INLVLA_INLVLA3_LENGTH                    equ 0001h
INLVLA_INLVLA3_MASK                      equ 0008h
INLVLA_INLVLA4_POSN                      equ 0004h
INLVLA_INLVLA4_POSITION                  equ 0004h
INLVLA_INLVLA4_SIZE                      equ 0001h
INLVLA_INLVLA4_LENGTH                    equ 0001h
INLVLA_INLVLA4_MASK                      equ 0010h
INLVLA_INLVLA5_POSN                      equ 0005h
INLVLA_INLVLA5_POSITION                  equ 0005h
INLVLA_INLVLA5_SIZE                      equ 0001h
INLVLA_INLVLA5_LENGTH                    equ 0001h
INLVLA_INLVLA5_MASK                      equ 0020h
INLVLA_INLVLA6_POSN                      equ 0006h
INLVLA_INLVLA6_POSITION                  equ 0006h
INLVLA_INLVLA6_SIZE                      equ 0001h
INLVLA_INLVLA6_LENGTH                    equ 0001h
INLVLA_INLVLA6_MASK                      equ 0040h
INLVLA_INLVLA7_POSN                      equ 0007h
INLVLA_INLVLA7_POSITION                  equ 0007h
INLVLA_INLVLA7_SIZE                      equ 0001h
INLVLA_INLVLA7_LENGTH                    equ 0001h
INLVLA_INLVLA7_MASK                      equ 0080h

// Register: SLRCONA
#define SLRCONA SLRCONA
SLRCONA                                  equ 0E8Fh
// bitfield definitions
SLRCONA_SLRA0_POSN                       equ 0000h
SLRCONA_SLRA0_POSITION                   equ 0000h
SLRCONA_SLRA0_SIZE                       equ 0001h
SLRCONA_SLRA0_LENGTH                     equ 0001h
SLRCONA_SLRA0_MASK                       equ 0001h
SLRCONA_SLRA1_POSN                       equ 0001h
SLRCONA_SLRA1_POSITION                   equ 0001h
SLRCONA_SLRA1_SIZE                       equ 0001h
SLRCONA_SLRA1_LENGTH                     equ 0001h
SLRCONA_SLRA1_MASK                       equ 0002h
SLRCONA_SLRA2_POSN                       equ 0002h
SLRCONA_SLRA2_POSITION                   equ 0002h
SLRCONA_SLRA2_SIZE                       equ 0001h
SLRCONA_SLRA2_LENGTH                     equ 0001h
SLRCONA_SLRA2_MASK                       equ 0004h
SLRCONA_SLRA3_POSN                       equ 0003h
SLRCONA_SLRA3_POSITION                   equ 0003h
SLRCONA_SLRA3_SIZE                       equ 0001h
SLRCONA_SLRA3_LENGTH                     equ 0001h
SLRCONA_SLRA3_MASK                       equ 0008h
SLRCONA_SLRA4_POSN                       equ 0004h
SLRCONA_SLRA4_POSITION                   equ 0004h
SLRCONA_SLRA4_SIZE                       equ 0001h
SLRCONA_SLRA4_LENGTH                     equ 0001h
SLRCONA_SLRA4_MASK                       equ 0010h
SLRCONA_SLRA5_POSN                       equ 0005h
SLRCONA_SLRA5_POSITION                   equ 0005h
SLRCONA_SLRA5_SIZE                       equ 0001h
SLRCONA_SLRA5_LENGTH                     equ 0001h
SLRCONA_SLRA5_MASK                       equ 0020h
SLRCONA_SLRA6_POSN                       equ 0006h
SLRCONA_SLRA6_POSITION                   equ 0006h
SLRCONA_SLRA6_SIZE                       equ 0001h
SLRCONA_SLRA6_LENGTH                     equ 0001h
SLRCONA_SLRA6_MASK                       equ 0040h
SLRCONA_SLRA7_POSN                       equ 0007h
SLRCONA_SLRA7_POSITION                   equ 0007h
SLRCONA_SLRA7_SIZE                       equ 0001h
SLRCONA_SLRA7_LENGTH                     equ 0001h
SLRCONA_SLRA7_MASK                       equ 0080h

// Register: ODCONA
#define ODCONA ODCONA
ODCONA                                   equ 0E90h
// bitfield definitions
ODCONA_ODCA0_POSN                        equ 0000h
ODCONA_ODCA0_POSITION                    equ 0000h
ODCONA_ODCA0_SIZE                        equ 0001h
ODCONA_ODCA0_LENGTH                      equ 0001h
ODCONA_ODCA0_MASK                        equ 0001h
ODCONA_ODCA1_POSN                        equ 0001h
ODCONA_ODCA1_POSITION                    equ 0001h
ODCONA_ODCA1_SIZE                        equ 0001h
ODCONA_ODCA1_LENGTH                      equ 0001h
ODCONA_ODCA1_MASK                        equ 0002h
ODCONA_ODCA2_POSN                        equ 0002h
ODCONA_ODCA2_POSITION                    equ 0002h
ODCONA_ODCA2_SIZE                        equ 0001h
ODCONA_ODCA2_LENGTH                      equ 0001h
ODCONA_ODCA2_MASK                        equ 0004h
ODCONA_ODCA3_POSN                        equ 0003h
ODCONA_ODCA3_POSITION                    equ 0003h
ODCONA_ODCA3_SIZE                        equ 0001h
ODCONA_ODCA3_LENGTH                      equ 0001h
ODCONA_ODCA3_MASK                        equ 0008h
ODCONA_ODCA4_POSN                        equ 0004h
ODCONA_ODCA4_POSITION                    equ 0004h
ODCONA_ODCA4_SIZE                        equ 0001h
ODCONA_ODCA4_LENGTH                      equ 0001h
ODCONA_ODCA4_MASK                        equ 0010h
ODCONA_ODCA5_POSN                        equ 0005h
ODCONA_ODCA5_POSITION                    equ 0005h
ODCONA_ODCA5_SIZE                        equ 0001h
ODCONA_ODCA5_LENGTH                      equ 0001h
ODCONA_ODCA5_MASK                        equ 0020h
ODCONA_ODCA6_POSN                        equ 0006h
ODCONA_ODCA6_POSITION                    equ 0006h
ODCONA_ODCA6_SIZE                        equ 0001h
ODCONA_ODCA6_LENGTH                      equ 0001h
ODCONA_ODCA6_MASK                        equ 0040h
ODCONA_ODCA7_POSN                        equ 0007h
ODCONA_ODCA7_POSITION                    equ 0007h
ODCONA_ODCA7_SIZE                        equ 0001h
ODCONA_ODCA7_LENGTH                      equ 0001h
ODCONA_ODCA7_MASK                        equ 0080h

