GopalSaraf/Practicals/PSDL/include/proc/pic18f66k40.inc
// Register: IOCEF
#define IOCEF IOCEF
IOCEF                                    equ 0EA8h
// bitfield definitions
IOCEF_IOCEF0_POSN                        equ 0000h
IOCEF_IOCEF0_POSITION                    equ 0000h
IOCEF_IOCEF0_SIZE                        equ 0001h
IOCEF_IOCEF0_LENGTH                      equ 0001h
IOCEF_IOCEF0_MASK                        equ 0001h
IOCEF_IOCEF1_POSN                        equ 0001h
IOCEF_IOCEF1_POSITION                    equ 0001h
IOCEF_IOCEF1_SIZE                        equ 0001h
IOCEF_IOCEF1_LENGTH                      equ 0001h
IOCEF_IOCEF1_MASK                        equ 0002h
IOCEF_IOCEF2_POSN                        equ 0002h
IOCEF_IOCEF2_POSITION                    equ 0002h
IOCEF_IOCEF2_SIZE                        equ 0001h
IOCEF_IOCEF2_LENGTH                      equ 0001h
IOCEF_IOCEF2_MASK                        equ 0004h
IOCEF_IOCEF3_POSN                        equ 0003h
IOCEF_IOCEF3_POSITION                    equ 0003h
IOCEF_IOCEF3_SIZE                        equ 0001h
IOCEF_IOCEF3_LENGTH                      equ 0001h
IOCEF_IOCEF3_MASK                        equ 0008h
IOCEF_IOCEF4_POSN                        equ 0004h
IOCEF_IOCEF4_POSITION                    equ 0004h
IOCEF_IOCEF4_SIZE                        equ 0001h
IOCEF_IOCEF4_LENGTH                      equ 0001h
IOCEF_IOCEF4_MASK                        equ 0010h
IOCEF_IOCEF5_POSN                        equ 0005h
IOCEF_IOCEF5_POSITION                    equ 0005h
IOCEF_IOCEF5_SIZE                        equ 0001h
IOCEF_IOCEF5_LENGTH                      equ 0001h
IOCEF_IOCEF5_MASK                        equ 0020h
IOCEF_IOCEF6_POSN                        equ 0006h
IOCEF_IOCEF6_POSITION                    equ 0006h
IOCEF_IOCEF6_SIZE                        equ 0001h
IOCEF_IOCEF6_LENGTH                      equ 0001h
IOCEF_IOCEF6_MASK                        equ 0040h
IOCEF_IOCEF7_POSN                        equ 0007h
IOCEF_IOCEF7_POSITION                    equ 0007h
IOCEF_IOCEF7_SIZE                        equ 0001h
IOCEF_IOCEF7_LENGTH                      equ 0001h
IOCEF_IOCEF7_MASK                        equ 0080h

// Register: IOCEN
#define IOCEN IOCEN
IOCEN                                    equ 0EA9h
// bitfield definitions
IOCEN_IOCEN0_POSN                        equ 0000h
IOCEN_IOCEN0_POSITION                    equ 0000h
IOCEN_IOCEN0_SIZE                        equ 0001h
IOCEN_IOCEN0_LENGTH                      equ 0001h
IOCEN_IOCEN0_MASK                        equ 0001h
IOCEN_IOCEN1_POSN                        equ 0001h
IOCEN_IOCEN1_POSITION                    equ 0001h
IOCEN_IOCEN1_SIZE                        equ 0001h
IOCEN_IOCEN1_LENGTH                      equ 0001h
IOCEN_IOCEN1_MASK                        equ 0002h
IOCEN_IOCEN2_POSN                        equ 0002h
IOCEN_IOCEN2_POSITION                    equ 0002h
IOCEN_IOCEN2_SIZE                        equ 0001h
IOCEN_IOCEN2_LENGTH                      equ 0001h
IOCEN_IOCEN2_MASK                        equ 0004h
IOCEN_IOCEN3_POSN                        equ 0003h
IOCEN_IOCEN3_POSITION                    equ 0003h
IOCEN_IOCEN3_SIZE                        equ 0001h
IOCEN_IOCEN3_LENGTH                      equ 0001h
IOCEN_IOCEN3_MASK                        equ 0008h
IOCEN_IOCEN4_POSN                        equ 0004h
IOCEN_IOCEN4_POSITION                    equ 0004h
IOCEN_IOCEN4_SIZE                        equ 0001h
IOCEN_IOCEN4_LENGTH                      equ 0001h
IOCEN_IOCEN4_MASK                        equ 0010h
IOCEN_IOCEN5_POSN                        equ 0005h
IOCEN_IOCEN5_POSITION                    equ 0005h
IOCEN_IOCEN5_SIZE                        equ 0001h
IOCEN_IOCEN5_LENGTH                      equ 0001h
IOCEN_IOCEN5_MASK                        equ 0020h
IOCEN_IOCEN6_POSN                        equ 0006h
IOCEN_IOCEN6_POSITION                    equ 0006h
IOCEN_IOCEN6_SIZE                        equ 0001h
IOCEN_IOCEN6_LENGTH                      equ 0001h
IOCEN_IOCEN6_MASK                        equ 0040h
IOCEN_IOCEN7_POSN                        equ 0007h
IOCEN_IOCEN7_POSITION                    equ 0007h
IOCEN_IOCEN7_SIZE                        equ 0001h
IOCEN_IOCEN7_LENGTH                      equ 0001h
IOCEN_IOCEN7_MASK                        equ 0080h

// Register: IOCEP
#define IOCEP IOCEP
IOCEP                                    equ 0EAAh
// bitfield definitions
IOCEP_IOCEP0_POSN                        equ 0000h
IOCEP_IOCEP0_POSITION                    equ 0000h
IOCEP_IOCEP0_SIZE                        equ 0001h
IOCEP_IOCEP0_LENGTH                      equ 0001h
IOCEP_IOCEP0_MASK                        equ 0001h
IOCEP_IOCEP1_POSN                        equ 0001h
IOCEP_IOCEP1_POSITION                    equ 0001h
IOCEP_IOCEP1_SIZE                        equ 0001h
IOCEP_IOCEP1_LENGTH                      equ 0001h
IOCEP_IOCEP1_MASK                        equ 0002h
IOCEP_IOCEP2_POSN                        equ 0002h
IOCEP_IOCEP2_POSITION                    equ 0002h
IOCEP_IOCEP2_SIZE                        equ 0001h
IOCEP_IOCEP2_LENGTH                      equ 0001h
IOCEP_IOCEP2_MASK                        equ 0004h
IOCEP_IOCEP3_POSN                        equ 0003h
IOCEP_IOCEP3_POSITION                    equ 0003h
IOCEP_IOCEP3_SIZE                        equ 0001h
IOCEP_IOCEP3_LENGTH                      equ 0001h
IOCEP_IOCEP3_MASK                        equ 0008h
IOCEP_IOCEP4_POSN                        equ 0004h
IOCEP_IOCEP4_POSITION                    equ 0004h
IOCEP_IOCEP4_SIZE                        equ 0001h
IOCEP_IOCEP4_LENGTH                      equ 0001h
IOCEP_IOCEP4_MASK                        equ 0010h
IOCEP_IOCEP5_POSN                        equ 0005h
IOCEP_IOCEP5_POSITION                    equ 0005h
IOCEP_IOCEP5_SIZE                        equ 0001h
IOCEP_IOCEP5_LENGTH                      equ 0001h
IOCEP_IOCEP5_MASK                        equ 0020h
IOCEP_IOCEP6_POSN                        equ 0006h
IOCEP_IOCEP6_POSITION                    equ 0006h
IOCEP_IOCEP6_SIZE                        equ 0001h
IOCEP_IOCEP6_LENGTH                      equ 0001h
IOCEP_IOCEP6_MASK                        equ 0040h
IOCEP_IOCEP7_POSN                        equ 0007h
IOCEP_IOCEP7_POSITION                    equ 0007h
IOCEP_IOCEP7_SIZE                        equ 0001h
IOCEP_IOCEP7_LENGTH                      equ 0001h
IOCEP_IOCEP7_MASK                        equ 0080h

// Register: INLVLE
#define INLVLE INLVLE
INLVLE                                   equ 0EABh
// bitfield definitions
INLVLE_INLVLE0_POSN                      equ 0000h
INLVLE_INLVLE0_POSITION                  equ 0000h
INLVLE_INLVLE0_SIZE                      equ 0001h
INLVLE_INLVLE0_LENGTH                    equ 0001h
INLVLE_INLVLE0_MASK                      equ 0001h
INLVLE_INLVLE1_POSN                      equ 0001h
INLVLE_INLVLE1_POSITION                  equ 0001h
INLVLE_INLVLE1_SIZE                      equ 0001h
INLVLE_INLVLE1_LENGTH                    equ 0001h
INLVLE_INLVLE1_MASK                      equ 0002h
INLVLE_INLVLE2_POSN                      equ 0002h
INLVLE_INLVLE2_POSITION                  equ 0002h
INLVLE_INLVLE2_SIZE                      equ 0001h
INLVLE_INLVLE2_LENGTH                    equ 0001h
INLVLE_INLVLE2_MASK                      equ 0004h
INLVLE_INLVLE3_POSN                      equ 0003h
INLVLE_INLVLE3_POSITION                  equ 0003h
INLVLE_INLVLE3_SIZE                      equ 0001h
INLVLE_INLVLE3_LENGTH                    equ 0001h
INLVLE_INLVLE3_MASK                      equ 0008h
INLVLE_INLVLE4_POSN                      equ 0004h
INLVLE_INLVLE4_POSITION                  equ 0004h
INLVLE_INLVLE4_SIZE                      equ 0001h
INLVLE_INLVLE4_LENGTH                    equ 0001h
INLVLE_INLVLE4_MASK                      equ 0010h
INLVLE_INLVLE5_POSN                      equ 0005h
INLVLE_INLVLE5_POSITION                  equ 0005h
INLVLE_INLVLE5_SIZE                      equ 0001h
INLVLE_INLVLE5_LENGTH                    equ 0001h
INLVLE_INLVLE5_MASK                      equ 0020h
INLVLE_INLVLE6_POSN                      equ 0006h
INLVLE_INLVLE6_POSITION                  equ 0006h
INLVLE_INLVLE6_SIZE                      equ 0001h
INLVLE_INLVLE6_LENGTH                    equ 0001h
INLVLE_INLVLE6_MASK                      equ 0040h
INLVLE_INLVLE7_POSN                      equ 0007h
INLVLE_INLVLE7_POSITION                  equ 0007h
INLVLE_INLVLE7_SIZE                      equ 0001h
INLVLE_INLVLE7_LENGTH                    equ 0001h
INLVLE_INLVLE7_MASK                      equ 0080h

// Register: SLRCONE
#define SLRCONE SLRCONE
SLRCONE                                  equ 0EACh
// bitfield definitions
SLRCONE_SLRE0_POSN                       equ 0000h
SLRCONE_SLRE0_POSITION                   equ 0000h
SLRCONE_SLRE0_SIZE                       equ 0001h
SLRCONE_SLRE0_LENGTH                     equ 0001h
SLRCONE_SLRE0_MASK                       equ 0001h
SLRCONE_SLRE1_POSN                       equ 0001h
SLRCONE_SLRE1_POSITION                   equ 0001h
SLRCONE_SLRE1_SIZE                       equ 0001h
SLRCONE_SLRE1_LENGTH                     equ 0001h
SLRCONE_SLRE1_MASK                       equ 0002h
SLRCONE_SLRE2_POSN                       equ 0002h
SLRCONE_SLRE2_POSITION                   equ 0002h
SLRCONE_SLRE2_SIZE                       equ 0001h
SLRCONE_SLRE2_LENGTH                     equ 0001h
SLRCONE_SLRE2_MASK                       equ 0004h
SLRCONE_SLRE3_POSN                       equ 0003h
SLRCONE_SLRE3_POSITION                   equ 0003h
SLRCONE_SLRE3_SIZE                       equ 0001h
SLRCONE_SLRE3_LENGTH                     equ 0001h
SLRCONE_SLRE3_MASK                       equ 0008h
SLRCONE_SLRE4_POSN                       equ 0004h
SLRCONE_SLRE4_POSITION                   equ 0004h
SLRCONE_SLRE4_SIZE                       equ 0001h
SLRCONE_SLRE4_LENGTH                     equ 0001h
SLRCONE_SLRE4_MASK                       equ 0010h
SLRCONE_SLRE5_POSN                       equ 0005h
SLRCONE_SLRE5_POSITION                   equ 0005h
SLRCONE_SLRE5_SIZE                       equ 0001h
SLRCONE_SLRE5_LENGTH                     equ 0001h
SLRCONE_SLRE5_MASK                       equ 0020h
SLRCONE_SLRE6_POSN                       equ 0006h
SLRCONE_SLRE6_POSITION                   equ 0006h
SLRCONE_SLRE6_SIZE                       equ 0001h
SLRCONE_SLRE6_LENGTH                     equ 0001h
SLRCONE_SLRE6_MASK                       equ 0040h
SLRCONE_SLRE7_POSN                       equ 0007h
SLRCONE_SLRE7_POSITION                   equ 0007h
SLRCONE_SLRE7_SIZE                       equ 0001h
SLRCONE_SLRE7_LENGTH                     equ 0001h
SLRCONE_SLRE7_MASK                       equ 0080h

// Register: ODCONE
#define ODCONE ODCONE
ODCONE                                   equ 0EADh
// bitfield definitions
ODCONE_ODCE0_POSN                        equ 0000h
ODCONE_ODCE0_POSITION                    equ 0000h
ODCONE_ODCE0_SIZE                        equ 0001h
ODCONE_ODCE0_LENGTH                      equ 0001h
ODCONE_ODCE0_MASK                        equ 0001h
ODCONE_ODCE1_POSN                        equ 0001h
ODCONE_ODCE1_POSITION                    equ 0001h
ODCONE_ODCE1_SIZE                        equ 0001h
ODCONE_ODCE1_LENGTH                      equ 0001h
ODCONE_ODCE1_MASK                        equ 0002h
ODCONE_ODCE2_POSN                        equ 0002h
ODCONE_ODCE2_POSITION                    equ 0002h
ODCONE_ODCE2_SIZE                        equ 0001h
ODCONE_ODCE2_LENGTH                      equ 0001h
ODCONE_ODCE2_MASK                        equ 0004h
ODCONE_ODCE3_POSN                        equ 0003h
ODCONE_ODCE3_POSITION                    equ 0003h
ODCONE_ODCE3_SIZE                        equ 0001h
ODCONE_ODCE3_LENGTH                      equ 0001h
ODCONE_ODCE3_MASK                        equ 0008h
ODCONE_ODCE4_POSN                        equ 0004h
ODCONE_ODCE4_POSITION                    equ 0004h
ODCONE_ODCE4_SIZE                        equ 0001h
ODCONE_ODCE4_LENGTH                      equ 0001h
ODCONE_ODCE4_MASK                        equ 0010h
ODCONE_ODCE5_POSN                        equ 0005h
ODCONE_ODCE5_POSITION                    equ 0005h
ODCONE_ODCE5_SIZE                        equ 0001h
ODCONE_ODCE5_LENGTH                      equ 0001h
ODCONE_ODCE5_MASK                        equ 0020h
ODCONE_ODCE6_POSN                        equ 0006h
ODCONE_ODCE6_POSITION                    equ 0006h
ODCONE_ODCE6_SIZE                        equ 0001h
ODCONE_ODCE6_LENGTH                      equ 0001h
ODCONE_ODCE6_MASK                        equ 0040h
ODCONE_ODCE7_POSN                        equ 0007h
ODCONE_ODCE7_POSITION                    equ 0007h
ODCONE_ODCE7_SIZE                        equ 0001h
ODCONE_ODCE7_LENGTH                      equ 0001h
ODCONE_ODCE7_MASK                        equ 0080h

// Register: WPUE
#define WPUE WPUE
WPUE                                     equ 0EAEh
// bitfield definitions
WPUE_WPUE0_POSN                          equ 0000h
WPUE_WPUE0_POSITION                      equ 0000h
WPUE_WPUE0_SIZE                          equ 0001h
WPUE_WPUE0_LENGTH                        equ 0001h
WPUE_WPUE0_MASK                          equ 0001h
WPUE_WPUE1_POSN                          equ 0001h
WPUE_WPUE1_POSITION                      equ 0001h
WPUE_WPUE1_SIZE                          equ 0001h
WPUE_WPUE1_LENGTH                        equ 0001h
WPUE_WPUE1_MASK                          equ 0002h
WPUE_WPUE2_POSN                          equ 0002h
WPUE_WPUE2_POSITION                      equ 0002h
WPUE_WPUE2_SIZE                          equ 0001h
WPUE_WPUE2_LENGTH                        equ 0001h
WPUE_WPUE2_MASK                          equ 0004h
WPUE_WPUE3_POSN                          equ 0003h
WPUE_WPUE3_POSITION                      equ 0003h
WPUE_WPUE3_SIZE                          equ 0001h
WPUE_WPUE3_LENGTH                        equ 0001h
WPUE_WPUE3_MASK                          equ 0008h
WPUE_WPUE4_POSN                          equ 0004h
WPUE_WPUE4_POSITION                      equ 0004h
WPUE_WPUE4_SIZE                          equ 0001h
WPUE_WPUE4_LENGTH                        equ 0001h
WPUE_WPUE4_MASK                          equ 0010h
WPUE_WPUE5_POSN                          equ 0005h
WPUE_WPUE5_POSITION                      equ 0005h
WPUE_WPUE5_SIZE                          equ 0001h
WPUE_WPUE5_LENGTH                        equ 0001h
WPUE_WPUE5_MASK                          equ 0020h
WPUE_WPUE6_POSN                          equ 0006h
WPUE_WPUE6_POSITION                      equ 0006h
WPUE_WPUE6_SIZE                          equ 0001h
WPUE_WPUE6_LENGTH                        equ 0001h
WPUE_WPUE6_MASK                          equ 0040h
WPUE_WPUE7_POSN                          equ 0007h
WPUE_WPUE7_POSITION                      equ 0007h
WPUE_WPUE7_SIZE                          equ 0001h
WPUE_WPUE7_LENGTH                        equ 0001h
WPUE_WPUE7_MASK                          equ 0080h

