GopalSaraf/Practicals/PSDL/include/proc/pic18f66k40.inc
// Register: SMT1TMRL
#define SMT1TMRL SMT1TMRL
SMT1TMRL                                 equ 0F0Ah
// bitfield definitions
SMT1TMRL_SMT1TMR_POSN                    equ 0000h
SMT1TMRL_SMT1TMR_POSITION                equ 0000h
SMT1TMRL_SMT1TMR_SIZE                    equ 0008h
SMT1TMRL_SMT1TMR_LENGTH                  equ 0008h
SMT1TMRL_SMT1TMR_MASK                    equ 00FFh
SMT1TMRL_SMT1TMR0_POSN                   equ 0000h
SMT1TMRL_SMT1TMR0_POSITION               equ 0000h
SMT1TMRL_SMT1TMR0_SIZE                   equ 0001h
SMT1TMRL_SMT1TMR0_LENGTH                 equ 0001h
SMT1TMRL_SMT1TMR0_MASK                   equ 0001h
SMT1TMRL_SMT1TMR1_POSN                   equ 0001h
SMT1TMRL_SMT1TMR1_POSITION               equ 0001h
SMT1TMRL_SMT1TMR1_SIZE                   equ 0001h
SMT1TMRL_SMT1TMR1_LENGTH                 equ 0001h
SMT1TMRL_SMT1TMR1_MASK                   equ 0002h
SMT1TMRL_SMT1TMR2_POSN                   equ 0002h
SMT1TMRL_SMT1TMR2_POSITION               equ 0002h
SMT1TMRL_SMT1TMR2_SIZE                   equ 0001h
SMT1TMRL_SMT1TMR2_LENGTH                 equ 0001h
SMT1TMRL_SMT1TMR2_MASK                   equ 0004h
SMT1TMRL_SMT1TMR3_POSN                   equ 0003h
SMT1TMRL_SMT1TMR3_POSITION               equ 0003h
SMT1TMRL_SMT1TMR3_SIZE                   equ 0001h
SMT1TMRL_SMT1TMR3_LENGTH                 equ 0001h
SMT1TMRL_SMT1TMR3_MASK                   equ 0008h
SMT1TMRL_SMT1TMR4_POSN                   equ 0004h
SMT1TMRL_SMT1TMR4_POSITION               equ 0004h
SMT1TMRL_SMT1TMR4_SIZE                   equ 0001h
SMT1TMRL_SMT1TMR4_LENGTH                 equ 0001h
SMT1TMRL_SMT1TMR4_MASK                   equ 0010h
SMT1TMRL_SMT1TMR5_POSN                   equ 0005h
SMT1TMRL_SMT1TMR5_POSITION               equ 0005h
SMT1TMRL_SMT1TMR5_SIZE                   equ 0001h
SMT1TMRL_SMT1TMR5_LENGTH                 equ 0001h
SMT1TMRL_SMT1TMR5_MASK                   equ 0020h
SMT1TMRL_SMT1TMR6_POSN                   equ 0006h
SMT1TMRL_SMT1TMR6_POSITION               equ 0006h
SMT1TMRL_SMT1TMR6_SIZE                   equ 0001h
SMT1TMRL_SMT1TMR6_LENGTH                 equ 0001h
SMT1TMRL_SMT1TMR6_MASK                   equ 0040h
SMT1TMRL_SMT1TMR7_POSN                   equ 0007h
SMT1TMRL_SMT1TMR7_POSITION               equ 0007h
SMT1TMRL_SMT1TMR7_SIZE                   equ 0001h
SMT1TMRL_SMT1TMR7_LENGTH                 equ 0001h
SMT1TMRL_SMT1TMR7_MASK                   equ 0080h

// Register: SMT1TMRH
#define SMT1TMRH SMT1TMRH
SMT1TMRH                                 equ 0F0Bh
// bitfield definitions
SMT1TMRH_SMT1TMR_POSN                    equ 0000h
SMT1TMRH_SMT1TMR_POSITION                equ 0000h
SMT1TMRH_SMT1TMR_SIZE                    equ 0008h
SMT1TMRH_SMT1TMR_LENGTH                  equ 0008h
SMT1TMRH_SMT1TMR_MASK                    equ 00FFh
SMT1TMRH_SMT1TMR8_POSN                   equ 0000h
SMT1TMRH_SMT1TMR8_POSITION               equ 0000h
SMT1TMRH_SMT1TMR8_SIZE                   equ 0001h
SMT1TMRH_SMT1TMR8_LENGTH                 equ 0001h
SMT1TMRH_SMT1TMR8_MASK                   equ 0001h
SMT1TMRH_SMT1TMR9_POSN                   equ 0001h
SMT1TMRH_SMT1TMR9_POSITION               equ 0001h
SMT1TMRH_SMT1TMR9_SIZE                   equ 0001h
SMT1TMRH_SMT1TMR9_LENGTH                 equ 0001h
SMT1TMRH_SMT1TMR9_MASK                   equ 0002h
SMT1TMRH_SMT1TMR10_POSN                  equ 0002h
SMT1TMRH_SMT1TMR10_POSITION              equ 0002h
SMT1TMRH_SMT1TMR10_SIZE                  equ 0001h
SMT1TMRH_SMT1TMR10_LENGTH                equ 0001h
SMT1TMRH_SMT1TMR10_MASK                  equ 0004h
SMT1TMRH_SMT1TMR11_POSN                  equ 0003h
SMT1TMRH_SMT1TMR11_POSITION              equ 0003h
SMT1TMRH_SMT1TMR11_SIZE                  equ 0001h
SMT1TMRH_SMT1TMR11_LENGTH                equ 0001h
SMT1TMRH_SMT1TMR11_MASK                  equ 0008h
SMT1TMRH_SMT1TMR12_POSN                  equ 0004h
SMT1TMRH_SMT1TMR12_POSITION              equ 0004h
SMT1TMRH_SMT1TMR12_SIZE                  equ 0001h
SMT1TMRH_SMT1TMR12_LENGTH                equ 0001h
SMT1TMRH_SMT1TMR12_MASK                  equ 0010h
SMT1TMRH_SMT1TMR13_POSN                  equ 0005h
SMT1TMRH_SMT1TMR13_POSITION              equ 0005h
SMT1TMRH_SMT1TMR13_SIZE                  equ 0001h
SMT1TMRH_SMT1TMR13_LENGTH                equ 0001h
SMT1TMRH_SMT1TMR13_MASK                  equ 0020h
SMT1TMRH_SMT1TMR14_POSN                  equ 0006h
SMT1TMRH_SMT1TMR14_POSITION              equ 0006h
SMT1TMRH_SMT1TMR14_SIZE                  equ 0001h
SMT1TMRH_SMT1TMR14_LENGTH                equ 0001h
SMT1TMRH_SMT1TMR14_MASK                  equ 0040h
SMT1TMRH_SMT1TMR15_POSN                  equ 0007h
SMT1TMRH_SMT1TMR15_POSITION              equ 0007h
SMT1TMRH_SMT1TMR15_SIZE                  equ 0001h
SMT1TMRH_SMT1TMR15_LENGTH                equ 0001h
SMT1TMRH_SMT1TMR15_MASK                  equ 0080h

// Register: SMT1TMRU
#define SMT1TMRU SMT1TMRU
SMT1TMRU                                 equ 0F0Ch
// bitfield definitions
SMT1TMRU_SMT1TMR_POSN                    equ 0000h
SMT1TMRU_SMT1TMR_POSITION                equ 0000h
SMT1TMRU_SMT1TMR_SIZE                    equ 0008h
SMT1TMRU_SMT1TMR_LENGTH                  equ 0008h
SMT1TMRU_SMT1TMR_MASK                    equ 00FFh
SMT1TMRU_SMT1TMR16_POSN                  equ 0000h
SMT1TMRU_SMT1TMR16_POSITION              equ 0000h
SMT1TMRU_SMT1TMR16_SIZE                  equ 0001h
SMT1TMRU_SMT1TMR16_LENGTH                equ 0001h
SMT1TMRU_SMT1TMR16_MASK                  equ 0001h
SMT1TMRU_SMT1TMR17_POSN                  equ 0001h
SMT1TMRU_SMT1TMR17_POSITION              equ 0001h
SMT1TMRU_SMT1TMR17_SIZE                  equ 0001h
SMT1TMRU_SMT1TMR17_LENGTH                equ 0001h
SMT1TMRU_SMT1TMR17_MASK                  equ 0002h
SMT1TMRU_SMT1TMR18_POSN                  equ 0002h
SMT1TMRU_SMT1TMR18_POSITION              equ 0002h
SMT1TMRU_SMT1TMR18_SIZE                  equ 0001h
SMT1TMRU_SMT1TMR18_LENGTH                equ 0001h
SMT1TMRU_SMT1TMR18_MASK                  equ 0004h
SMT1TMRU_SMT1TMR19_POSN                  equ 0003h
SMT1TMRU_SMT1TMR19_POSITION              equ 0003h
SMT1TMRU_SMT1TMR19_SIZE                  equ 0001h
SMT1TMRU_SMT1TMR19_LENGTH                equ 0001h
SMT1TMRU_SMT1TMR19_MASK                  equ 0008h
SMT1TMRU_SMT1TMR20_POSN                  equ 0004h
SMT1TMRU_SMT1TMR20_POSITION              equ 0004h
SMT1TMRU_SMT1TMR20_SIZE                  equ 0001h
SMT1TMRU_SMT1TMR20_LENGTH                equ 0001h
SMT1TMRU_SMT1TMR20_MASK                  equ 0010h
SMT1TMRU_SMT1TMR21_POSN                  equ 0005h
SMT1TMRU_SMT1TMR21_POSITION              equ 0005h
SMT1TMRU_SMT1TMR21_SIZE                  equ 0001h
SMT1TMRU_SMT1TMR21_LENGTH                equ 0001h
SMT1TMRU_SMT1TMR21_MASK                  equ 0020h
SMT1TMRU_SMT1TMR22_POSN                  equ 0006h
SMT1TMRU_SMT1TMR22_POSITION              equ 0006h
SMT1TMRU_SMT1TMR22_SIZE                  equ 0001h
SMT1TMRU_SMT1TMR22_LENGTH                equ 0001h
SMT1TMRU_SMT1TMR22_MASK                  equ 0040h
SMT1TMRU_SMT1TMR23_POSN                  equ 0007h
SMT1TMRU_SMT1TMR23_POSITION              equ 0007h
SMT1TMRU_SMT1TMR23_SIZE                  equ 0001h
SMT1TMRU_SMT1TMR23_LENGTH                equ 0001h
SMT1TMRU_SMT1TMR23_MASK                  equ 0080h

