GopalSaraf/Practicals/PSDL/include/proc/pic18f66k40.inc
#define RF7                              BANKMASK(PORTF), 7, a
#define RF7PPS0                          BANKMASK(RF7PPS), 0, b
#define RF7PPS1                          BANKMASK(RF7PPS), 1, b
#define RF7PPS2                          BANKMASK(RF7PPS), 2, b
#define RF7PPS3                          BANKMASK(RF7PPS), 3, b
#define RF7PPS4                          BANKMASK(RF7PPS), 4, b
#define RF7PPS5                          BANKMASK(RF7PPS), 5, b
#define RG0                              BANKMASK(PORTG), 0, a
#define RG0PPS0                          BANKMASK(RG0PPS), 0, b
#define RG0PPS1                          BANKMASK(RG0PPS), 1, b
#define RG0PPS2                          BANKMASK(RG0PPS), 2, b
#define RG0PPS3                          BANKMASK(RG0PPS), 3, b
#define RG0PPS4                          BANKMASK(RG0PPS), 4, b
#define RG0PPS5                          BANKMASK(RG0PPS), 5, b
#define RG1                              BANKMASK(PORTG), 1, a
#define RG1PPS0                          BANKMASK(RG1PPS), 0, b
#define RG1PPS1                          BANKMASK(RG1PPS), 1, b
#define RG1PPS2                          BANKMASK(RG1PPS), 2, b
#define RG1PPS3                          BANKMASK(RG1PPS), 3, b
#define RG1PPS4                          BANKMASK(RG1PPS), 4, b
#define RG1PPS5                          BANKMASK(RG1PPS), 5, b
#define RG2                              BANKMASK(PORTG), 2, a
#define RG2PPS0                          BANKMASK(RG2PPS), 0, b
#define RG2PPS1                          BANKMASK(RG2PPS), 1, b
#define RG2PPS2                          BANKMASK(RG2PPS), 2, b
#define RG2PPS3                          BANKMASK(RG2PPS), 3, b
#define RG2PPS4                          BANKMASK(RG2PPS), 4, b
#define RG2PPS5                          BANKMASK(RG2PPS), 5, b
#define RG3                              BANKMASK(PORTG), 3, a
#define RG3PPS0                          BANKMASK(RG3PPS), 0, b
#define RG3PPS1                          BANKMASK(RG3PPS), 1, b
#define RG3PPS2                          BANKMASK(RG3PPS), 2, b
#define RG3PPS3                          BANKMASK(RG3PPS), 3, b
#define RG3PPS4                          BANKMASK(RG3PPS), 4, b
#define RG3PPS5                          BANKMASK(RG3PPS), 5, b
#define RG4                              BANKMASK(PORTG), 4, a
#define RG4PPS0                          BANKMASK(RG4PPS), 0, b
#define RG4PPS1                          BANKMASK(RG4PPS), 1, b
#define RG4PPS2                          BANKMASK(RG4PPS), 2, b
#define RG4PPS3                          BANKMASK(RG4PPS), 3, b
#define RG4PPS4                          BANKMASK(RG4PPS), 4, b
#define RG4PPS5                          BANKMASK(RG4PPS), 5, b
#define RG5                              BANKMASK(PORTG), 5, a
#define RG6                              BANKMASK(PORTG), 6, a
#define RG6PPS0                          BANKMASK(RG6PPS), 0, b
#define RG6PPS1                          BANKMASK(RG6PPS), 1, b
#define RG6PPS2                          BANKMASK(RG6PPS), 2, b
#define RG6PPS3                          BANKMASK(RG6PPS), 3, b
#define RG6PPS4                          BANKMASK(RG6PPS), 4, b
#define RG6PPS5                          BANKMASK(RG6PPS), 5, b
#define RG7                              BANKMASK(PORTG), 7, a
#define RG7PPS0                          BANKMASK(RG7PPS), 0, b
#define RG7PPS1                          BANKMASK(RG7PPS), 1, b
#define RG7PPS2                          BANKMASK(RG7PPS), 2, b
#define RG7PPS3                          BANKMASK(RG7PPS), 3, b
#define RG7PPS4                          BANKMASK(RG7PPS), 4, b
#define RG7PPS5                          BANKMASK(RG7PPS), 5, b
#define RH0                              BANKMASK(PORTH), 0, a
#define RH0PPS0                          BANKMASK(RH0PPS), 0, b
#define RH0PPS1                          BANKMASK(RH0PPS), 1, b
#define RH0PPS2                          BANKMASK(RH0PPS), 2, b
#define RH0PPS3                          BANKMASK(RH0PPS), 3, b
#define RH0PPS4                          BANKMASK(RH0PPS), 4, b
#define RH0PPS5                          BANKMASK(RH0PPS), 5, b
#define RH1                              BANKMASK(PORTH), 1, a
#define RH1PPS0                          BANKMASK(RH1PPS), 0, b
#define RH1PPS1                          BANKMASK(RH1PPS), 1, b
#define RH1PPS2                          BANKMASK(RH1PPS), 2, b
#define RH1PPS3                          BANKMASK(RH1PPS), 3, b
#define RH1PPS4                          BANKMASK(RH1PPS), 4, b
#define RH1PPS5                          BANKMASK(RH1PPS), 5, b
#define RH2                              BANKMASK(PORTH), 2, a
#define RH2PPS0                          BANKMASK(RH2PPS), 0, b
#define RH2PPS1                          BANKMASK(RH2PPS), 1, b
#define RH2PPS2                          BANKMASK(RH2PPS), 2, b
#define RH2PPS3                          BANKMASK(RH2PPS), 3, b
#define RH2PPS4                          BANKMASK(RH2PPS), 4, b
#define RH2PPS5                          BANKMASK(RH2PPS), 5, b
#define RH3                              BANKMASK(PORTH), 3, a
#define RH3PPS0                          BANKMASK(RH3PPS), 0, b
#define RH3PPS1                          BANKMASK(RH3PPS), 1, b
#define RH3PPS2                          BANKMASK(RH3PPS), 2, b
#define RH3PPS3                          BANKMASK(RH3PPS), 3, b
#define RH3PPS4                          BANKMASK(RH3PPS), 4, b
#define RH3PPS5                          BANKMASK(RH3PPS), 5, b
#define RI                               BANKMASK(PCON0), 2, a
#define RMCLR                            BANKMASK(PCON0), 3, a
#define ROI                              BANKMASK(CPUDOZE), 5, b
#define RSEN1                            BANKMASK(SSP1CON2), 1, a
#define RSEN2                            BANKMASK(SSP2CON2), 1, b
#define RW1                              BANKMASK(SSP1STAT), 2, a
#define RW2                              BANKMASK(SSP2STAT), 2, b
#define RWDT                             BANKMASK(PCON0), 4, a
#define RX1PPS0                          BANKMASK(RX1PPS), 0, b
#define RX1PPS1                          BANKMASK(RX1PPS), 1, b
#define RX1PPS2                          BANKMASK(RX1PPS), 2, b
#define RX1PPS3                          BANKMASK(RX1PPS), 3, b
#define RX1PPS4                          BANKMASK(RX1PPS), 4, b
#define RX2PPS0                          BANKMASK(RX2PPS), 0, b
#define RX2PPS1                          BANKMASK(RX2PPS), 1, b
#define RX2PPS2                          BANKMASK(RX2PPS), 2, b
#define RX2PPS3                          BANKMASK(RX2PPS), 3, b
#define RX2PPS4                          BANKMASK(RX2PPS), 4, b
#define RX2PPS5                          BANKMASK(RX2PPS), 5, b
#define RX3PPS0                          BANKMASK(RX3PPS), 0, b
#define RX3PPS1                          BANKMASK(RX3PPS), 1, b
#define RX3PPS2                          BANKMASK(RX3PPS), 2, b
#define RX3PPS3                          BANKMASK(RX3PPS), 3, b
#define RX3PPS4                          BANKMASK(RX3PPS), 4, b
#define RX3PPS5                          BANKMASK(RX3PPS), 5, b
#define RX4PPS0                          BANKMASK(RX4PPS), 0, b
#define RX4PPS1                          BANKMASK(RX4PPS), 1, b
#define RX4PPS2                          BANKMASK(RX4PPS), 2, b
#define RX4PPS3                          BANKMASK(RX4PPS), 3, b
#define RX4PPS4                          BANKMASK(RX4PPS), 4, b
#define RX5PPS0                          BANKMASK(RX5PPS), 0, b
#define RX5PPS1                          BANKMASK(RX5PPS), 1, b
#define RX5PPS2                          BANKMASK(RX5PPS), 2, b
#define RX5PPS3                          BANKMASK(RX5PPS), 3, b
#define RX5PPS4                          BANKMASK(RX5PPS), 4, b
#define RX5PPS5                          BANKMASK(RX5PPS), 5, b
#define RXB0IE                           BANKMASK(PIE3), 0, b
#define RXB1IE                           BANKMASK(PIE3), 1, b
#define RXBNIE                           BANKMASK(PIE3), 1, b
#define RXBNIF                           BANKMASK(PIR3), 1, b
#define RXBNIP                           BANKMASK(IPR3), 1, b
#define R_NOT_W1                         BANKMASK(SSP1STAT), 2, a
#define R_NOT_W2                         BANKMASK(SSP2STAT), 2, b
#define R_W1                             BANKMASK(SSP1STAT), 2, a
#define R_W2                             BANKMASK(SSP2STAT), 2, b
#define R_nW1                            BANKMASK(SSP1STAT), 2, a
#define R_nW2                            BANKMASK(SSP2STAT), 2, b
#define SBOREN                           BANKMASK(BORCON), 7, b
#define SCANBUSY                         BANKMASK(SCANCON0), 5, b
#define SCANEN                           BANKMASK(SCANCON0), 7, b
#define SCANGO                           BANKMASK(SCANCON0), 6, b
#define SCANHADR0                        BANKMASK(SCANHADRL), 0, b
#define SCANHADR1                        BANKMASK(SCANHADRL), 1, b
#define SCANHADR10                       BANKMASK(SCANHADRH), 2, b
#define SCANHADR11                       BANKMASK(SCANHADRH), 3, b
#define SCANHADR12                       BANKMASK(SCANHADRH), 4, b
#define SCANHADR13                       BANKMASK(SCANHADRH), 5, b
#define SCANHADR14                       BANKMASK(SCANHADRH), 6, b
#define SCANHADR15                       BANKMASK(SCANHADRH), 7, b
#define SCANHADR16                       BANKMASK(SCANHADRU), 0, b
#define SCANHADR17                       BANKMASK(SCANHADRU), 1, b
#define SCANHADR18                       BANKMASK(SCANHADRU), 2, b
#define SCANHADR19                       BANKMASK(SCANHADRU), 3, b
#define SCANHADR2                        BANKMASK(SCANHADRL), 2, b
#define SCANHADR20                       BANKMASK(SCANHADRU), 4, b
#define SCANHADR21                       BANKMASK(SCANHADRU), 5, b
#define SCANHADR3                        BANKMASK(SCANHADRL), 3, b
#define SCANHADR4                        BANKMASK(SCANHADRL), 4, b
#define SCANHADR5                        BANKMASK(SCANHADRL), 5, b
#define SCANHADR6                        BANKMASK(SCANHADRL), 6, b
#define SCANHADR7                        BANKMASK(SCANHADRL), 7, b
#define SCANHADR8                        BANKMASK(SCANHADRH), 0, b
#define SCANHADR9                        BANKMASK(SCANHADRH), 1, b
#define SCANIE                           BANKMASK(PIE8), 7, b
#define SCANIF                           BANKMASK(PIR8), 7, b
#define SCANINTM                         BANKMASK(SCANCON0), 3, b
#define SCANINVALID                      BANKMASK(SCANCON0), 4, b
#define SCANIP                           BANKMASK(IPR8), 7, b
#define SCANLADR0                        BANKMASK(SCANLADRL), 0, b
#define SCANLADR1                        BANKMASK(SCANLADRL), 1, b
#define SCANLADR10                       BANKMASK(SCANLADRH), 2, b
#define SCANLADR11                       BANKMASK(SCANLADRH), 3, b
#define SCANLADR12                       BANKMASK(SCANLADRH), 4, b
#define SCANLADR13                       BANKMASK(SCANLADRH), 5, b
#define SCANLADR14                       BANKMASK(SCANLADRH), 6, b
#define SCANLADR15                       BANKMASK(SCANLADRH), 7, b
#define SCANLADR16                       BANKMASK(SCANLADRU), 0, b
#define SCANLADR17                       BANKMASK(SCANLADRU), 1, b
#define SCANLADR18                       BANKMASK(SCANLADRU), 2, b
#define SCANLADR19                       BANKMASK(SCANLADRU), 3, b
#define SCANLADR2                        BANKMASK(SCANLADRL), 2, b
#define SCANLADR20                       BANKMASK(SCANLADRU), 4, b
#define SCANLADR21                       BANKMASK(SCANLADRU), 5, b
#define SCANLADR3                        BANKMASK(SCANLADRL), 3, b
#define SCANLADR4                        BANKMASK(SCANLADRL), 4, b
#define SCANLADR5                        BANKMASK(SCANLADRL), 5, b
#define SCANLADR6                        BANKMASK(SCANLADRL), 6, b
#define SCANLADR7                        BANKMASK(SCANLADRL), 7, b
#define SCANLADR8                        BANKMASK(SCANLADRH), 0, b
#define SCANLADR9                        BANKMASK(SCANLADRH), 1, b
#define SCANMD                           BANKMASK(PMD0), 3, b
#define SCANMODE0                        BANKMASK(SCANCON0), 0, b
#define SCANMODE1                        BANKMASK(SCANCON0), 1, b
#define SCANTSEL0                        BANKMASK(SCANTRIG), 0, b
#define SCANTSEL1                        BANKMASK(SCANTRIG), 1, b
#define SCANTSEL2                        BANKMASK(SCANTRIG), 2, b
#define SCANTSEL3                        BANKMASK(SCANTRIG), 3, b
#define SCKP1                            BANKMASK(BAUD1CON), 4, a
#define SCKP2                            BANKMASK(BAUD2CON), 4, b
#define SEL0                             BANKMASK(HLVDCON1), 0, b
#define SEL1                             BANKMASK(HLVDCON1), 1, b
#define SEL2                             BANKMASK(HLVDCON1), 2, b
#define SEL3                             BANKMASK(HLVDCON1), 3, b
#define SEN1                             BANKMASK(SSP1CON2), 0, a
#define SEN2                             BANKMASK(SSP2CON2), 0, b
#define SENDB1                           BANKMASK(TX1STA), 3, a
#define SHFT0                            BANKMASK(CRCSHIFTL), 0, b
#define SHFT1                            BANKMASK(CRCSHIFTL), 1, b
#define SHFT10                           BANKMASK(CRCSHIFTH), 2, b
#define SHFT11                           BANKMASK(CRCSHIFTH), 3, b
#define SHFT12                           BANKMASK(CRCSHIFTH), 4, b
#define SHFT13                           BANKMASK(CRCSHIFTH), 5, b
#define SHFT14                           BANKMASK(CRCSHIFTH), 6, b
#define SHFT15                           BANKMASK(CRCSHIFTH), 7, b
#define SHFT2                            BANKMASK(CRCSHIFTL), 2, b
#define SHFT3                            BANKMASK(CRCSHIFTL), 3, b
#define SHFT4                            BANKMASK(CRCSHIFTL), 4, b
#define SHFT5                            BANKMASK(CRCSHIFTL), 5, b
#define SHFT6                            BANKMASK(CRCSHIFTL), 6, b
#define SHFT7                            BANKMASK(CRCSHIFTL), 7, b
#define SHFT8                            BANKMASK(CRCSHIFTH), 0, b
#define SHFT9                            BANKMASK(CRCSHIFTH), 1, b
#define SHIFTM                           BANKMASK(CRCCON0), 1, b
#define SHUTDOWN                         BANKMASK(CWG1AS0), 7, b
#define SLRA0                            BANKMASK(SLRCONA), 0, b
#define SLRA1                            BANKMASK(SLRCONA), 1, b
#define SLRA2                            BANKMASK(SLRCONA), 2, b
#define SLRA3                            BANKMASK(SLRCONA), 3, b
#define SLRA4                            BANKMASK(SLRCONA), 4, b
#define SLRA5                            BANKMASK(SLRCONA), 5, b
#define SLRA6                            BANKMASK(SLRCONA), 6, b
#define SLRA7                            BANKMASK(SLRCONA), 7, b
#define SLRB0                            BANKMASK(SLRCONB), 0, b
#define SLRB1                            BANKMASK(SLRCONB), 1, b
#define SLRB2                            BANKMASK(SLRCONB), 2, b
#define SLRB3                            BANKMASK(SLRCONB), 3, b
#define SLRB4                            BANKMASK(SLRCONB), 4, b
#define SLRB5                            BANKMASK(SLRCONB), 5, b
#define SLRB6                            BANKMASK(SLRCONB), 6, b
#define SLRB7                            BANKMASK(SLRCONB), 7, b
#define SLRC0                            BANKMASK(SLRCONC), 0, b
#define SLRC1                            BANKMASK(SLRCONC), 1, b
#define SLRC2                            BANKMASK(SLRCONC), 2, b
#define SLRC3                            BANKMASK(SLRCONC), 3, b
#define SLRC4                            BANKMASK(SLRCONC), 4, b
#define SLRC5                            BANKMASK(SLRCONC), 5, b
#define SLRC6                            BANKMASK(SLRCONC), 6, b
#define SLRC7                            BANKMASK(SLRCONC), 7, b
#define SLRD0                            BANKMASK(SLRCOND), 0, b
#define SLRD1                            BANKMASK(SLRCOND), 1, b
#define SLRD2                            BANKMASK(SLRCOND), 2, b
#define SLRD3                            BANKMASK(SLRCOND), 3, b
#define SLRD4                            BANKMASK(SLRCOND), 4, b
#define SLRD5                            BANKMASK(SLRCOND), 5, b
#define SLRD6                            BANKMASK(SLRCOND), 6, b
#define SLRD7                            BANKMASK(SLRCOND), 7, b
#define SLRE0                            BANKMASK(SLRCONE), 0, b
#define SLRE1                            BANKMASK(SLRCONE), 1, b
#define SLRE2                            BANKMASK(SLRCONE), 2, b
#define SLRE3                            BANKMASK(SLRCONE), 3, b
#define SLRE4                            BANKMASK(SLRCONE), 4, b
#define SLRE5                            BANKMASK(SLRCONE), 5, b
#define SLRE6                            BANKMASK(SLRCONE), 6, b
#define SLRE7                            BANKMASK(SLRCONE), 7, b
#define SLRF0                            BANKMASK(SLRCONF), 0, b
#define SLRF1                            BANKMASK(SLRCONF), 1, b
#define SLRF2                            BANKMASK(SLRCONF), 2, b
#define SLRF3                            BANKMASK(SLRCONF), 3, b
#define SLRF4                            BANKMASK(SLRCONF), 4, b
#define SLRF5                            BANKMASK(SLRCONF), 5, b
#define SLRF6                            BANKMASK(SLRCONF), 6, b
#define SLRF7                            BANKMASK(SLRCONF), 7, b
#define SLRG0                            BANKMASK(SLRCONG), 0, b
#define SLRG1                            BANKMASK(SLRCONG), 1, b
#define SLRG2                            BANKMASK(SLRCONG), 2, b
#define SLRG3                            BANKMASK(SLRCONG), 3, b
#define SLRG4                            BANKMASK(SLRCONG), 4, b
#define SLRG6                            BANKMASK(SLRCONG), 6, b
#define SLRG7                            BANKMASK(SLRCONG), 7, b
#define SLRH0                            BANKMASK(SLRCONH), 0, b
#define SLRH1                            BANKMASK(SLRCONH), 1, b
#define SLRH2                            BANKMASK(SLRCONH), 2, b
#define SLRH3                            BANKMASK(SLRCONH), 3, b
#define SMP1                             BANKMASK(SSP1STAT), 7, a
#define SMP2                             BANKMASK(SSP2STAT), 7, b
#define SMT1AS                           BANKMASK(SMT1STAT), 0, b
#define SMT1CPR0                         BANKMASK(SMT1CPRL), 0, b
#define SMT1CPR1                         BANKMASK(SMT1CPRL), 1, b
#define SMT1CPR10                        BANKMASK(SMT1CPRH), 2, b
#define SMT1CPR11                        BANKMASK(SMT1CPRH), 3, b
#define SMT1CPR12                        BANKMASK(SMT1CPRH), 4, b
#define SMT1CPR13                        BANKMASK(SMT1CPRH), 5, b
#define SMT1CPR14                        BANKMASK(SMT1CPRH), 6, b
#define SMT1CPR15                        BANKMASK(SMT1CPRH), 7, b
#define SMT1CPR16                        BANKMASK(SMT1CPRU), 0, b
#define SMT1CPR17                        BANKMASK(SMT1CPRU), 1, b
#define SMT1CPR18                        BANKMASK(SMT1CPRU), 2, b
#define SMT1CPR19                        BANKMASK(SMT1CPRU), 3, b
#define SMT1CPR2                         BANKMASK(SMT1CPRL), 2, b
#define SMT1CPR20                        BANKMASK(SMT1CPRU), 4, b
#define SMT1CPR21                        BANKMASK(SMT1CPRU), 5, b
#define SMT1CPR22                        BANKMASK(SMT1CPRU), 6, b
#define SMT1CPR23                        BANKMASK(SMT1CPRU), 7, b
#define SMT1CPR3                         BANKMASK(SMT1CPRL), 3, b
#define SMT1CPR4                         BANKMASK(SMT1CPRL), 4, b
#define SMT1CPR5                         BANKMASK(SMT1CPRL), 5, b
#define SMT1CPR6                         BANKMASK(SMT1CPRL), 6, b
#define SMT1CPR7                         BANKMASK(SMT1CPRL), 7, b
#define SMT1CPR8                         BANKMASK(SMT1CPRH), 0, b
#define SMT1CPR9                         BANKMASK(SMT1CPRH), 1, b
#define SMT1CPRUP                        BANKMASK(SMT1STAT), 7, b
#define SMT1CPW0                         BANKMASK(SMT1CPWL), 0, b
#define SMT1CPW1                         BANKMASK(SMT1CPWL), 1, b
#define SMT1CPW10                        BANKMASK(SMT1CPWH), 2, b
#define SMT1CPW11                        BANKMASK(SMT1CPWH), 3, b
#define SMT1CPW12                        BANKMASK(SMT1CPWH), 4, b
#define SMT1CPW13                        BANKMASK(SMT1CPWH), 5, b
#define SMT1CPW14                        BANKMASK(SMT1CPWH), 6, b
#define SMT1CPW15                        BANKMASK(SMT1CPWH), 7, b
#define SMT1CPW16                        BANKMASK(SMT1CPWU), 0, b
#define SMT1CPW17                        BANKMASK(SMT1CPWU), 1, b
#define SMT1CPW18                        BANKMASK(SMT1CPWU), 2, b
#define SMT1CPW19                        BANKMASK(SMT1CPWU), 3, b
#define SMT1CPW2                         BANKMASK(SMT1CPWL), 2, b
#define SMT1CPW20                        BANKMASK(SMT1CPWU), 4, b
#define SMT1CPW21                        BANKMASK(SMT1CPWU), 5, b
#define SMT1CPW22                        BANKMASK(SMT1CPWU), 6, b
#define SMT1CPW23                        BANKMASK(SMT1CPWU), 7, b
#define SMT1CPW3                         BANKMASK(SMT1CPWL), 3, b
#define SMT1CPW4                         BANKMASK(SMT1CPWL), 4, b
#define SMT1CPW5                         BANKMASK(SMT1CPWL), 5, b
#define SMT1CPW6                         BANKMASK(SMT1CPWL), 6, b
#define SMT1CPW7                         BANKMASK(SMT1CPWL), 7, b
#define SMT1CPW8                         BANKMASK(SMT1CPWH), 0, b
#define SMT1CPW9                         BANKMASK(SMT1CPWH), 1, b
#define SMT1CPWUP                        BANKMASK(SMT1STAT), 6, b
#define SMT1CSEL0                        BANKMASK(SMT1CLK), 0, b
#define SMT1CSEL1                        BANKMASK(SMT1CLK), 1, b
#define SMT1CSEL2                        BANKMASK(SMT1CLK), 2, b
#define SMT1GO                           BANKMASK(SMT1CON1), 7, b
#define SMT1IE                           BANKMASK(PIE9), 0, b
#define SMT1IF                           BANKMASK(PIR9), 0, b
#define SMT1IP                           BANKMASK(IPR9), 0, b
#define SMT1MODE0                        BANKMASK(SMT1CON1), 0, b
#define SMT1MODE1                        BANKMASK(SMT1CON1), 1, b
#define SMT1MODE2                        BANKMASK(SMT1CON1), 2, b
#define SMT1MODE3                        BANKMASK(SMT1CON1), 3, b
#define SMT1PR0                          BANKMASK(SMT1PRL), 0, b
#define SMT1PR1                          BANKMASK(SMT1PRL), 1, b
#define SMT1PR10                         BANKMASK(SMT1PRH), 2, b
#define SMT1PR11                         BANKMASK(SMT1PRH), 3, b
#define SMT1PR12                         BANKMASK(SMT1PRH), 4, b
#define SMT1PR13                         BANKMASK(SMT1PRH), 5, b
#define SMT1PR14                         BANKMASK(SMT1PRH), 6, b
#define SMT1PR15                         BANKMASK(SMT1PRH), 7, b
#define SMT1PR16                         BANKMASK(SMT1PRU), 0, b
#define SMT1PR17                         BANKMASK(SMT1PRU), 1, b
#define SMT1PR18                         BANKMASK(SMT1PRU), 2, b
#define SMT1PR19                         BANKMASK(SMT1PRU), 3, b
#define SMT1PR2                          BANKMASK(SMT1PRL), 2, b
#define SMT1PR20                         BANKMASK(SMT1PRU), 4, b
#define SMT1PR21                         BANKMASK(SMT1PRU), 5, b
#define SMT1PR22                         BANKMASK(SMT1PRU), 6, b
#define SMT1PR23                         BANKMASK(SMT1PRU), 7, b
#define SMT1PR3                          BANKMASK(SMT1PRL), 3, b
#define SMT1PR4                          BANKMASK(SMT1PRL), 4, b
#define SMT1PR5                          BANKMASK(SMT1PRL), 5, b
#define SMT1PR6                          BANKMASK(SMT1PRL), 6, b
#define SMT1PR7                          BANKMASK(SMT1PRL), 7, b
#define SMT1PR8                          BANKMASK(SMT1PRH), 0, b
#define SMT1PR9                          BANKMASK(SMT1PRH), 1, b
#define SMT1PRAIE                        BANKMASK(PIE9), 1, b
#define SMT1PRAIF                        BANKMASK(PIR9), 1, b
