GopalSaraf/Practicals/PSDL/include/proc/pic18f66k40.inc
#define T2MODE4                          BANKMASK(T2HLT), 4, a
#define T2ON                             BANKMASK(T2CON), 7, a
#define T2OUTPS0                         BANKMASK(T2CON), 0, a
#define T2OUTPS1                         BANKMASK(T2CON), 1, a
#define T2OUTPS2                         BANKMASK(T2CON), 2, a
#define T2OUTPS3                         BANKMASK(T2CON), 3, a
#define T2PSYNC                          BANKMASK(T2HLT), 7, a
#define T2RSEL0                          BANKMASK(T2RST), 0, a
#define T2RSEL1                          BANKMASK(T2RST), 1, a
#define T2RSEL2                          BANKMASK(T2RST), 2, a
#define T2RSEL3                          BANKMASK(T2RST), 3, a
#define T3CKIPPS0                        BANKMASK(T3CKIPPS), 0, b
#define T3CKIPPS1                        BANKMASK(T3CKIPPS), 1, b
#define T3CKIPPS2                        BANKMASK(T3CKIPPS), 2, b
#define T3CKIPPS3                        BANKMASK(T3CKIPPS), 3, b
#define T3CKIPPS4                        BANKMASK(T3CKIPPS), 4, b
#define T3CKPS0                          BANKMASK(T3CON), 4, a
#define T3CKPS1                          BANKMASK(T3CON), 5, a
#define T3CS0                            BANKMASK(T3CLK), 0, a
#define T3CS1                            BANKMASK(T3CLK), 1, a
#define T3CS2                            BANKMASK(T3CLK), 2, a
#define T3CS3                            BANKMASK(T3CLK), 3, a
#define T3GE                             BANKMASK(T3GCON), 7, a
#define T3GGO                            BANKMASK(T3GCON), 3, a
#define T3GGO_NOT_DONE                   BANKMASK(T3GCON), 3, a
#define T3GGO_nDONE                      BANKMASK(T3GCON), 3, a
#define T3GPOL                           BANKMASK(T3GCON), 6, a
#define T3GPPS0                          BANKMASK(T3GPPS), 0, b
#define T3GPPS1                          BANKMASK(T3GPPS), 1, b
#define T3GPPS2                          BANKMASK(T3GPPS), 2, b
#define T3GPPS3                          BANKMASK(T3GPPS), 3, b
#define T3GPPS4                          BANKMASK(T3GPPS), 4, b
#define T3GSPM                           BANKMASK(T3GCON), 4, a
#define T3GSS0                           BANKMASK(T3GATE), 0, a
#define T3GSS1                           BANKMASK(T3GATE), 1, a
#define T3GSS2                           BANKMASK(T3GATE), 2, a
#define T3GSS3                           BANKMASK(T3GATE), 3, a
#define T3GTM                            BANKMASK(T3GCON), 5, a
#define T3GVAL                           BANKMASK(T3GCON), 2, a
#define T3RD16                           BANKMASK(T3CON), 1, a
#define T4CKPOL                          BANKMASK(T4HLT), 6, a
#define T4CKPS0                          BANKMASK(T4CON), 4, a
#define T4CKPS1                          BANKMASK(T4CON), 5, a
#define T4CKPS2                          BANKMASK(T4CON), 6, a
#define T4CKSYNC                         BANKMASK(T4HLT), 5, a
#define T4CS0                            BANKMASK(T4CLKCON), 0, a
#define T4CS1                            BANKMASK(T4CLKCON), 1, a
#define T4CS2                            BANKMASK(T4CLKCON), 2, a
#define T4CS3                            BANKMASK(T4CLKCON), 3, a
#define T4INPPS0                         BANKMASK(T4INPPS), 0, b
#define T4INPPS1                         BANKMASK(T4INPPS), 1, b
#define T4INPPS2                         BANKMASK(T4INPPS), 2, b
#define T4INPPS3                         BANKMASK(T4INPPS), 3, b
#define T4INPPS4                         BANKMASK(T4INPPS), 4, b
#define T4INPPS5                         BANKMASK(T4INPPS), 5, b
#define T4MODE0                          BANKMASK(T4HLT), 0, a
#define T4MODE1                          BANKMASK(T4HLT), 1, a
#define T4MODE2                          BANKMASK(T4HLT), 2, a
#define T4MODE3                          BANKMASK(T4HLT), 3, a
#define T4MODE4                          BANKMASK(T4HLT), 4, a
#define T4ON                             BANKMASK(T4CON), 7, a
#define T4OUTPS0                         BANKMASK(T4CON), 0, a
#define T4OUTPS1                         BANKMASK(T4CON), 1, a
#define T4OUTPS2                         BANKMASK(T4CON), 2, a
#define T4OUTPS3                         BANKMASK(T4CON), 3, a
#define T4PSYNC                          BANKMASK(T4HLT), 7, a
#define T4RSEL0                          BANKMASK(T4RST), 0, a
#define T4RSEL1                          BANKMASK(T4RST), 1, a
#define T4RSEL2                          BANKMASK(T4RST), 2, a
#define T4RSEL3                          BANKMASK(T4RST), 3, a
#define T5CKIPPS0                        BANKMASK(T5CKIPPS), 0, b
#define T5CKIPPS1                        BANKMASK(T5CKIPPS), 1, b
#define T5CKIPPS2                        BANKMASK(T5CKIPPS), 2, b
#define T5CKIPPS3                        BANKMASK(T5CKIPPS), 3, b
#define T5CKIPPS4                        BANKMASK(T5CKIPPS), 4, b
#define T5CKIPPS5                        BANKMASK(T5CKIPPS), 5, b
#define T5CKPS0                          BANKMASK(T5CON), 4, a
#define T5CKPS1                          BANKMASK(T5CON), 5, a
#define T5CS0                            BANKMASK(T5CLK), 0, a
#define T5CS1                            BANKMASK(T5CLK), 1, a
#define T5CS2                            BANKMASK(T5CLK), 2, a
#define T5CS3                            BANKMASK(T5CLK), 3, a
#define T5GE                             BANKMASK(T5GCON), 7, a
#define T5GGO                            BANKMASK(T5GCON), 3, a
#define T5GGO_NOT_DONE                   BANKMASK(T5GCON), 3, a
#define T5GGO_nDONE                      BANKMASK(T5GCON), 3, a
#define T5GPOL                           BANKMASK(T5GCON), 6, a
#define T5GPPS0                          BANKMASK(T5GPPS), 0, b
#define T5GPPS1                          BANKMASK(T5GPPS), 1, b
#define T5GPPS2                          BANKMASK(T5GPPS), 2, b
#define T5GPPS3                          BANKMASK(T5GPPS), 3, b
#define T5GPPS4                          BANKMASK(T5GPPS), 4, b
#define T5GPPS5                          BANKMASK(T5GPPS), 5, b
#define T5GSPM                           BANKMASK(T5GCON), 4, a
#define T5GSS0                           BANKMASK(T5GATE), 0, a
#define T5GSS1                           BANKMASK(T5GATE), 1, a
#define T5GSS2                           BANKMASK(T5GATE), 2, a
#define T5GSS3                           BANKMASK(T5GATE), 3, a
#define T5GTM                            BANKMASK(T5GCON), 5, a
#define T5GVAL                           BANKMASK(T5GCON), 2, a
#define T5RD16                           BANKMASK(T5CON), 1, a
#define T6CKPOL                          BANKMASK(T6HLT), 6, a
#define T6CKPS0                          BANKMASK(T6CON), 4, a
#define T6CKPS1                          BANKMASK(T6CON), 5, a
#define T6CKPS2                          BANKMASK(T6CON), 6, a
#define T6CKSYNC                         BANKMASK(T6HLT), 5, a
#define T6CS0                            BANKMASK(T6CLKCON), 0, a
#define T6CS1                            BANKMASK(T6CLKCON), 1, a
#define T6CS2                            BANKMASK(T6CLKCON), 2, a
#define T6CS3                            BANKMASK(T6CLKCON), 3, a
#define T6INPPS0                         BANKMASK(T6INPPS), 0, b
#define T6INPPS1                         BANKMASK(T6INPPS), 1, b
#define T6INPPS2                         BANKMASK(T6INPPS), 2, b
#define T6INPPS3                         BANKMASK(T6INPPS), 3, b
#define T6INPPS4                         BANKMASK(T6INPPS), 4, b
#define T6MODE0                          BANKMASK(T6HLT), 0, a
#define T6MODE1                          BANKMASK(T6HLT), 1, a
#define T6MODE2                          BANKMASK(T6HLT), 2, a
#define T6MODE3                          BANKMASK(T6HLT), 3, a
#define T6MODE4                          BANKMASK(T6HLT), 4, a
#define T6ON                             BANKMASK(T6CON), 7, a
#define T6OUTPS0                         BANKMASK(T6CON), 0, a
#define T6OUTPS1                         BANKMASK(T6CON), 1, a
#define T6OUTPS2                         BANKMASK(T6CON), 2, a
#define T6OUTPS3                         BANKMASK(T6CON), 3, a
#define T6PSYNC                          BANKMASK(T6HLT), 7, a
#define T6RSEL0                          BANKMASK(T6RST), 0, a
#define T6RSEL1                          BANKMASK(T6RST), 1, a
#define T6RSEL2                          BANKMASK(T6RST), 2, a
#define T6RSEL3                          BANKMASK(T6RST), 3, a
#define T7CKIPPS0                        BANKMASK(T7CKIPPS), 0, b
#define T7CKIPPS1                        BANKMASK(T7CKIPPS), 1, b
#define T7CKIPPS2                        BANKMASK(T7CKIPPS), 2, b
#define T7CKIPPS3                        BANKMASK(T7CKIPPS), 3, b
#define T7CKIPPS4                        BANKMASK(T7CKIPPS), 4, b
#define T7CKIPPS5                        BANKMASK(T7CKIPPS), 5, b
#define T7CKPS0                          BANKMASK(T7CON), 4, b
#define T7CKPS1                          BANKMASK(T7CON), 5, b
#define T7CS0                            BANKMASK(T7CLK), 0, b
#define T7CS1                            BANKMASK(T7CLK), 1, b
#define T7CS2                            BANKMASK(T7CLK), 2, b
#define T7CS3                            BANKMASK(T7CLK), 3, b
#define T7GE                             BANKMASK(T7GCON), 7, b
#define T7GGO                            BANKMASK(T7GCON), 3, b
#define T7GGO_NOT_DONE                   BANKMASK(T7GCON), 3, b
#define T7GGO_nDONE                      BANKMASK(T7GCON), 3, b
#define T7GPOL                           BANKMASK(T7GCON), 6, b
#define T7GPPS0                          BANKMASK(T7GPPS), 0, b
#define T7GPPS1                          BANKMASK(T7GPPS), 1, b
#define T7GPPS2                          BANKMASK(T7GPPS), 2, b
#define T7GPPS3                          BANKMASK(T7GPPS), 3, b
#define T7GPPS4                          BANKMASK(T7GPPS), 4, b
#define T7GPPS5                          BANKMASK(T7GPPS), 5, b
#define T7GSPM                           BANKMASK(T7GCON), 4, b
#define T7GSS0                           BANKMASK(T7GATE), 0, b
#define T7GSS1                           BANKMASK(T7GATE), 1, b
#define T7GSS2                           BANKMASK(T7GATE), 2, b
#define T7GSS3                           BANKMASK(T7GATE), 3, b
#define T7GSS4                           BANKMASK(T7GATE), 4, b
#define T7GTM                            BANKMASK(T7GCON), 5, b
#define T7GVAL                           BANKMASK(T7GCON), 2, b
#define T7RD16                           BANKMASK(T7CON), 1, b
#define T8CKPOL                          BANKMASK(T8HLT), 6, b
#define T8CKPS0                          BANKMASK(T8CON), 4, b
#define T8CKPS1                          BANKMASK(T8CON), 5, b
#define T8CKPS2                          BANKMASK(T8CON), 6, b
#define T8CKSYNC                         BANKMASK(T8HLT), 5, b
#define T8CS0                            BANKMASK(T8CLKCON), 0, b
#define T8CS1                            BANKMASK(T8CLKCON), 1, b
#define T8CS2                            BANKMASK(T8CLKCON), 2, b
#define T8CS3                            BANKMASK(T8CLKCON), 3, b
#define T8INPPS0                         BANKMASK(T8INPPS), 0, b
#define T8INPPS1                         BANKMASK(T8INPPS), 1, b
#define T8INPPS2                         BANKMASK(T8INPPS), 2, b
#define T8INPPS3                         BANKMASK(T8INPPS), 3, b
#define T8INPPS4                         BANKMASK(T8INPPS), 4, b
#define T8INPPS5                         BANKMASK(T8INPPS), 5, b
#define T8MODE0                          BANKMASK(T8HLT), 0, b
#define T8MODE1                          BANKMASK(T8HLT), 1, b
#define T8MODE2                          BANKMASK(T8HLT), 2, b
#define T8MODE3                          BANKMASK(T8HLT), 3, b
#define T8MODE4                          BANKMASK(T8HLT), 4, b
#define T8ON                             BANKMASK(T8CON), 7, b
#define T8OUTPS0                         BANKMASK(T8CON), 0, b
#define T8OUTPS1                         BANKMASK(T8CON), 1, b
#define T8OUTPS2                         BANKMASK(T8CON), 2, b
#define T8OUTPS3                         BANKMASK(T8CON), 3, b
#define T8PSYNC                          BANKMASK(T8HLT), 7, b
#define T8RSEL0                          BANKMASK(T8RST), 0, b
#define T8RSEL1                          BANKMASK(T8RST), 1, b
#define T8RSEL2                          BANKMASK(T8RST), 2, b
#define T8RSEL3                          BANKMASK(T8RST), 3, b
#define TMR0H0                           BANKMASK(TMR0H), 0, a
#define TMR0H1                           BANKMASK(TMR0H), 1, a
#define TMR0H2                           BANKMASK(TMR0H), 2, a
#define TMR0H3                           BANKMASK(TMR0H), 3, a
#define TMR0H4                           BANKMASK(TMR0H), 4, a
#define TMR0H5                           BANKMASK(TMR0H), 5, a
#define TMR0H6                           BANKMASK(TMR0H), 6, a
#define TMR0H7                           BANKMASK(TMR0H), 7, a
#define TMR0IE                           BANKMASK(PIE0), 5, b
#define TMR0IF                           BANKMASK(PIR0), 5, b
#define TMR0IP                           BANKMASK(IPR0), 5, b
#define TMR0L0                           BANKMASK(TMR0L), 0, a
#define TMR0L1                           BANKMASK(TMR0L), 1, a
#define TMR0L2                           BANKMASK(TMR0L), 2, a
#define TMR0L3                           BANKMASK(TMR0L), 3, a
#define TMR0L4                           BANKMASK(TMR0L), 4, a
#define TMR0L5                           BANKMASK(TMR0L), 5, a
#define TMR0L6                           BANKMASK(TMR0L), 6, a
#define TMR0L7                           BANKMASK(TMR0L), 7, a
#define TMR0MD                           BANKMASK(PMD1), 0, b
#define TMR10                            BANKMASK(TMR1L), 0, a
#define TMR11                            BANKMASK(TMR1L), 1, a
#define TMR110                           BANKMASK(TMR1H), 2, a
#define TMR111                           BANKMASK(TMR1H), 3, a
#define TMR112                           BANKMASK(TMR1H), 4, a
#define TMR113                           BANKMASK(TMR1H), 5, a
#define TMR114                           BANKMASK(TMR1H), 6, a
#define TMR115                           BANKMASK(TMR1H), 7, a
#define TMR12                            BANKMASK(TMR1L), 2, a
#define TMR13                            BANKMASK(TMR1L), 3, a
#define TMR14                            BANKMASK(TMR1L), 4, a
#define TMR15                            BANKMASK(TMR1L), 5, a
#define TMR16                            BANKMASK(TMR1L), 6, a
#define TMR17                            BANKMASK(TMR1L), 7, a
#define TMR18                            BANKMASK(TMR1H), 0, a
#define TMR19                            BANKMASK(TMR1H), 1, a
#define TMR1GIE                          BANKMASK(PIE6), 0, b
#define TMR1GIF                          BANKMASK(PIR6), 0, b
#define TMR1GIP                          BANKMASK(IPR6), 0, b
#define TMR1H0                           BANKMASK(TMR1H), 0, a
#define TMR1H1                           BANKMASK(TMR1H), 1, a
#define TMR1H2                           BANKMASK(TMR1H), 2, a
#define TMR1H3                           BANKMASK(TMR1H), 3, a
#define TMR1H4                           BANKMASK(TMR1H), 4, a
#define TMR1H5                           BANKMASK(TMR1H), 5, a
#define TMR1H6                           BANKMASK(TMR1H), 6, a
#define TMR1H7                           BANKMASK(TMR1H), 7, a
#define TMR1IE                           BANKMASK(PIE5), 0, b
#define TMR1IF                           BANKMASK(PIR5), 0, b
#define TMR1IP                           BANKMASK(IPR5), 0, b
#define TMR1L0                           BANKMASK(TMR1L), 0, a
#define TMR1L1                           BANKMASK(TMR1L), 1, a
#define TMR1L2                           BANKMASK(TMR1L), 2, a
#define TMR1L3                           BANKMASK(TMR1L), 3, a
#define TMR1L4                           BANKMASK(TMR1L), 4, a
#define TMR1L5                           BANKMASK(TMR1L), 5, a
#define TMR1L6                           BANKMASK(TMR1L), 6, a
#define TMR1L7                           BANKMASK(TMR1L), 7, a
#define TMR1MD                           BANKMASK(PMD1), 1, b
#define TMR1ON                           BANKMASK(T1CON), 0, a
#define TMR2IE                           BANKMASK(PIE5), 1, b
#define TMR2IF                           BANKMASK(PIR5), 1, b
#define TMR2IP                           BANKMASK(IPR5), 1, b
#define TMR2MD                           BANKMASK(PMD1), 2, b
#define TMR2ON                           BANKMASK(T2CON), 7, a
#define TMR30                            BANKMASK(TMR3L), 0, a
#define TMR31                            BANKMASK(TMR3L), 1, a
#define TMR310                           BANKMASK(TMR3H), 2, a
#define TMR311                           BANKMASK(TMR3H), 3, a
#define TMR312                           BANKMASK(TMR3H), 4, a
#define TMR313                           BANKMASK(TMR3H), 5, a
#define TMR314                           BANKMASK(TMR3H), 6, a
#define TMR315                           BANKMASK(TMR3H), 7, a
#define TMR32                            BANKMASK(TMR3L), 2, a
#define TMR33                            BANKMASK(TMR3L), 3, a
#define TMR34                            BANKMASK(TMR3L), 4, a
#define TMR35                            BANKMASK(TMR3L), 5, a
#define TMR36                            BANKMASK(TMR3L), 6, a
#define TMR37                            BANKMASK(TMR3L), 7, a
#define TMR38                            BANKMASK(TMR3H), 0, a
#define TMR39                            BANKMASK(TMR3H), 1, a
#define TMR3GIE                          BANKMASK(PIE6), 1, b
#define TMR3GIF                          BANKMASK(PIR6), 1, b
#define TMR3GIP                          BANKMASK(IPR6), 1, b
#define TMR3H0                           BANKMASK(TMR3H), 0, a
#define TMR3H1                           BANKMASK(TMR3H), 1, a
#define TMR3H2                           BANKMASK(TMR3H), 2, a
#define TMR3H3                           BANKMASK(TMR3H), 3, a
#define TMR3H4                           BANKMASK(TMR3H), 4, a
#define TMR3H5                           BANKMASK(TMR3H), 5, a
#define TMR3H6                           BANKMASK(TMR3H), 6, a
#define TMR3H7                           BANKMASK(TMR3H), 7, a
#define TMR3IE                           BANKMASK(PIE5), 2, b
#define TMR3IF                           BANKMASK(PIR5), 2, b
#define TMR3IP                           BANKMASK(IPR5), 2, b
#define TMR3L0                           BANKMASK(TMR3L), 0, a
#define TMR3L1                           BANKMASK(TMR3L), 1, a
#define TMR3L2                           BANKMASK(TMR3L), 2, a
#define TMR3L3                           BANKMASK(TMR3L), 3, a
#define TMR3L4                           BANKMASK(TMR3L), 4, a
#define TMR3L5                           BANKMASK(TMR3L), 5, a
#define TMR3L6                           BANKMASK(TMR3L), 6, a
#define TMR3L7                           BANKMASK(TMR3L), 7, a
#define TMR3MD                           BANKMASK(PMD1), 3, b
#define TMR3ON                           BANKMASK(T3CON), 0, a
#define TMR4IE                           BANKMASK(PIE5), 3, b
#define TMR4IF                           BANKMASK(PIR5), 3, b
#define TMR4IP                           BANKMASK(IPR5), 3, b
#define TMR4MD                           BANKMASK(PMD1), 4, b
#define TMR4ON                           BANKMASK(T4CON), 7, a
#define TMR50                            BANKMASK(TMR5L), 0, a
#define TMR51                            BANKMASK(TMR5L), 1, a
#define TMR510                           BANKMASK(TMR5H), 2, a
#define TMR511                           BANKMASK(TMR5H), 3, a
#define TMR512                           BANKMASK(TMR5H), 4, a
#define TMR513                           BANKMASK(TMR5H), 5, a
#define TMR514                           BANKMASK(TMR5H), 6, a
#define TMR515                           BANKMASK(TMR5H), 7, a
#define TMR52                            BANKMASK(TMR5L), 2, a
#define TMR53                            BANKMASK(TMR5L), 3, a
#define TMR54                            BANKMASK(TMR5L), 4, a
#define TMR55                            BANKMASK(TMR5L), 5, a
#define TMR56                            BANKMASK(TMR5L), 6, a
#define TMR57                            BANKMASK(TMR5L), 7, a
#define TMR58                            BANKMASK(TMR5H), 0, a
#define TMR59                            BANKMASK(TMR5H), 1, a
#define TMR5GIE                          BANKMASK(PIE6), 2, b
#define TMR5GIF                          BANKMASK(PIR6), 2, b
#define TMR5GIP                          BANKMASK(IPR6), 2, b
#define TMR5H0                           BANKMASK(TMR5H), 0, a
#define TMR5H1                           BANKMASK(TMR5H), 1, a
#define TMR5H2                           BANKMASK(TMR5H), 2, a
#define TMR5H3                           BANKMASK(TMR5H), 3, a
#define TMR5H4                           BANKMASK(TMR5H), 4, a
#define TMR5H5                           BANKMASK(TMR5H), 5, a
#define TMR5H6                           BANKMASK(TMR5H), 6, a
#define TMR5H7                           BANKMASK(TMR5H), 7, a
#define TMR5IE                           BANKMASK(PIE5), 4, b
#define TMR5IF                           BANKMASK(PIR5), 4, b
#define TMR5IP                           BANKMASK(IPR5), 4, b
#define TMR5L0                           BANKMASK(TMR5L), 0, a
#define TMR5L1                           BANKMASK(TMR5L), 1, a
#define TMR5L2                           BANKMASK(TMR5L), 2, a
#define TMR5L3                           BANKMASK(TMR5L), 3, a
#define TMR5L4                           BANKMASK(TMR5L), 4, a
#define TMR5L5                           BANKMASK(TMR5L), 5, a
#define TMR5L6                           BANKMASK(TMR5L), 6, a
#define TMR5L7                           BANKMASK(TMR5L), 7, a
#define TMR5MD                           BANKMASK(PMD1), 5, b
#define TMR5ON                           BANKMASK(T5CON), 0, a
#define TMR6IE                           BANKMASK(PIE5), 5, b
#define TMR6IF                           BANKMASK(PIR5), 5, b
#define TMR6IP                           BANKMASK(IPR5), 5, b
#define TMR6MD                           BANKMASK(PMD1), 6, b
#define TMR6ON                           BANKMASK(T6CON), 7, a
#define TMR70                            BANKMASK(TMR7L), 0, b
#define TMR71                            BANKMASK(TMR7L), 1, b
#define TMR710                           BANKMASK(TMR7H), 2, b
#define TMR711                           BANKMASK(TMR7H), 3, b
#define TMR712                           BANKMASK(TMR7H), 4, b
#define TMR713                           BANKMASK(TMR7H), 5, b
#define TMR714                           BANKMASK(TMR7H), 6, b
#define TMR715                           BANKMASK(TMR7H), 7, b
#define TMR72                            BANKMASK(TMR7L), 2, b
#define TMR73                            BANKMASK(TMR7L), 3, b
#define TMR74                            BANKMASK(TMR7L), 4, b
#define TMR75                            BANKMASK(TMR7L), 5, b
#define TMR76                            BANKMASK(TMR7L), 6, b
#define TMR77                            BANKMASK(TMR7L), 7, b
#define TMR78                            BANKMASK(TMR7H), 0, b
#define TMR79                            BANKMASK(TMR7H), 1, b
#define TMR7GIE                          BANKMASK(PIE6), 3, b
#define TMR7GIF                          BANKMASK(PIR6), 3, b
#define TMR7GIP                          BANKMASK(IPR6), 3, b
#define TMR7H0                           BANKMASK(TMR7H), 0, b
#define TMR7H1                           BANKMASK(TMR7H), 1, b
#define TMR7H2                           BANKMASK(TMR7H), 2, b
#define TMR7H3                           BANKMASK(TMR7H), 3, b
#define TMR7H4                           BANKMASK(TMR7H), 4, b
#define TMR7H5                           BANKMASK(TMR7H), 5, b
#define TMR7H6                           BANKMASK(TMR7H), 6, b
#define TMR7H7                           BANKMASK(TMR7H), 7, b
#define TMR7IE                           BANKMASK(PIE5), 6, b
#define TMR7IF                           BANKMASK(PIR5), 6, b
#define TMR7IP                           BANKMASK(IPR5), 6, b
#define TMR7L0                           BANKMASK(TMR7L), 0, b
